pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                        File 'pic18_metamodel.cpp'                         *
//                 Generated by version GALGAS_BETA_VERSION                  *
//                     january 17th, 2010, at 19h28'56"                      *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

//---------------------------------------------------------------------------*

#include "version_libpm.h"
#if LIBPM_VERSION != THE_LIBPM_VERSION
  #error "This file has been compiled with a version of GALGAS different than the version of libpm"
#endif

//---------------------------------------------------------------------------*

#include <typeinfo>
#include "utilities/MF_MemoryControl.h"
#include "files/C_TextFileWrite.h"
#include "galgas/C_galgas_CLI_Options.h"
#include "pic18_metamodel.h"

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_metamodel.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif


//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

//---------------------------------------------------------------------------*
//                                                                           *
//                    class 'e_bootloaderReservedRAMmap'                     *
//                                                                           *
//---------------------------------------------------------------------------*

e_bootloaderReservedRAMmap::e_bootloaderReservedRAMmap (void) :
mReservedSize () {
}

//---------------------------------------------------------------------------*
//                                                                           *
//                  class map '@bootloaderReservedRAMmap'                    *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_bootloaderReservedRAMmap ("bootloaderReservedRAMmap", false, NULL) ;

//---------------------------------------------------------------------------*

elementOf_GGS_bootloaderReservedRAMmap::
elementOf_GGS_bootloaderReservedRAMmap (const GGS_lstring & inKey,
              const PMSInt32 inIndex,
              const e_bootloaderReservedRAMmap & inInfo) :
AC_galgas_map_element (inKey, inIndex),
mInfo (inInfo) {
}

//---------------------------------------------------------------------------*

void elementOf_GGS_bootloaderReservedRAMmap::
appendForMapDescription (const PMSInt32 inElementIndex,
                         C_String & ioString,
                         const PMSInt32 inIndentation) const {
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "|-key " ;
  ioString.appendSigned (inElementIndex) ;
  ioString << ":" << mKey.reader_description (inIndentation + 1) ;
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "|-value " ;
  ioString.appendSigned (inElementIndex) ;
  ioString << ":" << mInfo.mReservedSize.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*

bool elementOf_GGS_bootloaderReservedRAMmap::
isEqualToMapElement (const AC_galgas_map_element * inOperand) const {
  const elementOf_GGS_bootloaderReservedRAMmap * ptr = dynamic_cast <const elementOf_GGS_bootloaderReservedRAMmap *> (inOperand) ;
  macroValidPointer (ptr) ;
  return (mInfo.mReservedSize.operator_isEqual (ptr->mInfo.mReservedSize)).boolValue () ;
}

//---------------------------------------------------------------------------*

AC_galgas_map_element * GGS_bootloaderReservedRAMmap::
new_element (const GGS_lstring & inKey, void * inInfo) {
  MF_Assert (reinterpret_cast <e_bootloaderReservedRAMmap *> (inInfo) != NULL, "Dynamic cast error", 0, 0) ;
  AC_galgas_map_element * p = NULL ;
  e_bootloaderReservedRAMmap * info = (e_bootloaderReservedRAMmap *) inInfo ;
  macroMyNew (p, cElement (inKey, nextIndex (), * info)) ;
  return p ;
}

//---------------------------------------------------------------------------*

void GGS_bootloaderReservedRAMmap::
assignInfo (AC_galgas_map_element * inPtr, void * inInfo) {
  MF_Assert (reinterpret_cast <cElement *> (inPtr) != NULL, "Dynamic cast error", 0, 0) ;
  MF_Assert (reinterpret_cast <e_bootloaderReservedRAMmap *> (inInfo) != NULL, "Dynamic cast error", 0, 0) ;
  cElement * p = (cElement *) inPtr ;
  e_bootloaderReservedRAMmap * info = (e_bootloaderReservedRAMmap *) inInfo ;
  p->mInfo = * info ;
}

//---------------------------------------------------------------------------*

GGS_bootloaderReservedRAMmap GGS_bootloaderReservedRAMmap::
constructor_emptyMap (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) {
  GGS_bootloaderReservedRAMmap result ;
  macroMyNew (result.mSharedMapRoot, cMapRoot) ;
  return result ;
}

//---------------------------------------------------------------------------*

void GGS_bootloaderReservedRAMmap::
enterIndex (const GGS_lstring & inKey,
            AC_galgas_index_core & outIndex) {
  e_bootloaderReservedRAMmap info  ;
  internalEnterIndex (inKey,
                      (void *) & info,
                      outIndex) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_bootloaderReservedRAMmap::
operator_isEqual (const GGS_bootloaderReservedRAMmap & inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (), isEqualToMap (inOperand)) ;
}

//---------------------------------------------------------------------------*

