pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
/* const */ GGS_luint  & GGS_bootloaderReservedRAMmap::cEnumerator::_mReservedSize (LOCATION_ARGS) const {
  return ((cElement *) mObjectArray (mCurrentIndex COMMA_THERE))->mInfo.mReservedSize ;
}

//---------------------------------------------------------------------------*

GGS_object GGS_bootloaderReservedRAMmap::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_bootloaderReservedRAMmap * p = NULL ;
    macroMyNew (p, GGS_bootloaderReservedRAMmap (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bootloaderReservedRAMmap GGS_bootloaderReservedRAMmap::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_bootloaderReservedRAMmap result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_bootloaderReservedRAMmap * p = dynamic_cast <const GGS_bootloaderReservedRAMmap *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_bootloaderReservedRAMmap, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_bootloaderReservedRAMmap::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_bootloaderReservedRAMmap ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                     class 'cPtr_piccolo_instruction'                      *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_piccolo_instruction::
cPtr_piccolo_instruction (const GGS_location & argument_0
                                COMMA_LOCATION_ARGS)
:cPtr__AC_galgas_class (THERE),
mInstructionLocation (argument_0) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_piccolo_instruction * GGS_piccolo_instruction::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_piccolo_instruction *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_piccolo_instruction *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

void cPtr_piccolo_instruction::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@piccolo_instruction:"
           << mInstructionLocation.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_piccolo_instruction::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_piccolo_instruction::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_piccolo_instruction (& typeid (cPtr_piccolo_instruction), NULL, "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_piccolo_instruction::galgasRTTI (void) const {
  return & gClassInfoFor__piccolo_instruction ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                  GALGAS class 'GGS_piccolo_instruction'                   *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_piccolo_instruction ("piccolo_instruction", true, NULL) ;

//---------------------------------------------------------------------------*

GGS_piccolo_instruction::
GGS_piccolo_instruction (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_piccolo_instruction::
GGS_piccolo_instruction (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_piccolo_instruction GGS_piccolo_instruction::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_piccolo_instruction result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_piccolo_instruction *> (inPointer) != NULL)
      : (typeid (cPtr_piccolo_instruction) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_piccolo_instruction (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_piccolo_instruction),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

