pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
cPtr__AC_galgas_class * cPtr_instruction_nobanksel::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_instruction_nobanksel (mInstructionLocation COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                 GALGAS class 'GGS_instruction_nobanksel'                  *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_instruction_nobanksel ("instruction_nobanksel", true, & kTypeDescriptor_GGS_piccolo_instruction) ;

//---------------------------------------------------------------------------*

GGS_instruction_nobanksel::
GGS_instruction_nobanksel (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_instruction_nobanksel::
GGS_instruction_nobanksel (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_instruction_nobanksel GGS_instruction_nobanksel::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_instruction_nobanksel result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_instruction_nobanksel *> (inPointer) != NULL)
      : (typeid (cPtr_instruction_nobanksel) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_instruction_nobanksel (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_instruction_nobanksel),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_nobanksel GGS_instruction_nobanksel::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_location & argument_0
                                COMMA_LOCATION_ARGS) {
  GGS_instruction_nobanksel result ;
  macroMyNew (result.mPointer, cPtr_instruction_nobanksel (argument_0 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_nobanksel::actualTypeName (void) const {
  return "instruction_nobanksel" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_nobanksel ("instruction_nobanksel", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_nobanksel) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_nobanksel::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_nobanksel * p = NULL ;
    macroMyNew (p, GGS_instruction_nobanksel (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_nobanksel GGS_instruction_nobanksel::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_nobanksel result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_nobanksel * p = dynamic_cast <const GGS_instruction_nobanksel *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_nobanksel, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_nobanksel::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_nobanksel ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                     class 'cPtr_instruction_banksel'                      *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_banksel::
cPtr_instruction_banksel (const GGS_location & argument_0,
                                const GGS_luint & argument_1
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mBankIndex (argument_1) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_banksel * GGS_instruction_banksel::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_banksel *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_banksel *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_instruction_banksel::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_instruction_banksel * ptr = dynamic_cast <const cPtr_instruction_banksel *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mInstructionLocation.operator_isEqual (ptr->mInstructionLocation).boolValue ()
         && mBankIndex.operator_isEqual (ptr->mBankIndex).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

