pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
void cPtr_instruction_banksel::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_banksel:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mBankIndex.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_instruction_banksel::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_instruction_banksel::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_instruction_banksel (& typeid (cPtr_instruction_banksel), & typeid (cPtr_piccolo_instruction), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_instruction_banksel::galgasRTTI (void) const {
  return & gClassInfoFor__instruction_banksel ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_instruction_banksel::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_instruction_banksel (mInstructionLocation, mBankIndex COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                  GALGAS class 'GGS_instruction_banksel'                   *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_instruction_banksel ("instruction_banksel", true, & kTypeDescriptor_GGS_piccolo_instruction) ;

//---------------------------------------------------------------------------*

GGS_instruction_banksel::
GGS_instruction_banksel (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_instruction_banksel::
GGS_instruction_banksel (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_instruction_banksel GGS_instruction_banksel::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_instruction_banksel result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_instruction_banksel *> (inPointer) != NULL)
      : (typeid (cPtr_instruction_banksel) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_instruction_banksel (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_instruction_banksel),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_banksel GGS_instruction_banksel::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_location & argument_0,
                 const GGS_luint & argument_1
                                COMMA_LOCATION_ARGS) {
  GGS_instruction_banksel result ;
  macroMyNew (result.mPointer, cPtr_instruction_banksel (argument_0,
                                argument_1 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_luint  GGS_instruction_banksel::
reader_mBankIndex (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_luint   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_banksel *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_banksel *) mPointer)->mBankIndex ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_banksel::actualTypeName (void) const {
  return "instruction_banksel" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_banksel ("instruction_banksel", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_banksel) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_banksel::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_banksel * p = NULL ;
    macroMyNew (p, GGS_instruction_banksel (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_banksel GGS_instruction_banksel::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_banksel result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_banksel * p = dynamic_cast <const GGS_instruction_banksel *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_banksel, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_banksel::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_banksel ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                    class 'cPtr_instruction_savebank'                      *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_savebank::
cPtr_instruction_savebank (const GGS_location & argument_0,
                                const GGS_registerExpression & argument_1,
                                const GGS_instructionList & argument_2,
                                const GGS_location & argument_3
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mRegister (argument_1),
mInstructionList (argument_2),
mEndOfSaveBankInstruction (argument_3) {
}

//---------------------------------------------------------------------------*

