pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
const char * GGS_instruction_savebank::actualTypeName (void) const {
  return "instruction_savebank" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_savebank ("instruction_savebank", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_savebank) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_savebank::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_savebank * p = NULL ;
    macroMyNew (p, GGS_instruction_savebank (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_savebank GGS_instruction_savebank::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_savebank result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_savebank * p = dynamic_cast <const GGS_instruction_savebank *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_savebank, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_savebank::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_savebank ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//            Class for 'instruction_FDA_base_code' Enumeration              *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_instruction_FDA_base_code ("instruction_FDA_base_code", false, NULL) ;

//---------------------------------------------------------------------------*

bool GGS_instruction_FDA_base_code::
isBuilt (void) const {
  return mValue > kNotBuilt ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_FDA_base_code::
operator_isEqual (const GGS_instruction_FDA_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue == inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_FDA_base_code::
operator_isNotEqual (const GGS_instruction_FDA_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue != inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_FDA_base_code::
operator_infOrEqual (const GGS_instruction_FDA_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue <= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_FDA_base_code::
operator_supOrEqual (const GGS_instruction_FDA_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue >= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_FDA_base_code::
operator_strictInf (const GGS_instruction_FDA_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue < inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_FDA_base_code::
operator_strictSup (const GGS_instruction_FDA_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue > inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_instruction_FDA_base_code::
reader_mnemonic (C_Compiler & /* inLexique */
                       COMMA_UNUSED_LOCATION_ARGS) const {
  const char * kMessages [22] = {"",
    "ADDWF",
    "ADDWFC",
    "ANDWF",
    "COMF",
    "DCFSNZ",
    "DECF",
    "DECFSZ",
    "INCF",
    "INCFSZ",
    "INFSNZ",
    "IORWF",
    "MOVF",
    "RLCF",
    "RLNCF",
    "RRCF",
    "RRNCF",
    "SUBFWB",
    "SUBWF",
    "SUBWFB",
    "SWAPF",
    "XORWF"
  } ;
  return GGS_string (mValue > 0, kMessages [mValue]) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_instruction_FDA_base_code::
reader_description (const PMSInt32 /* inIndentation */) const {
  C_String s ;
  s << "<enum @instruction_FDA_base_code" ;
  switch (mValue) {
  case enum_ADDWF:
    s << " ADDWF>" ;
    break ;
  case enum_ADDWFC:
    s << " ADDWFC>" ;
    break ;
  case enum_ANDWF:
    s << " ANDWF>" ;
    break ;
  case enum_COMF:
    s << " COMF>" ;
    break ;
  case enum_DCFSNZ:
    s << " DCFSNZ>" ;
    break ;
  case enum_DECF:
    s << " DECF>" ;
    break ;
  case enum_DECFSZ:
    s << " DECFSZ>" ;
    break ;
  case enum_INCF:
    s << " INCF>" ;
    break ;
  case enum_INCFSZ:
    s << " INCFSZ>" ;
    break ;
  case enum_INFSNZ:
    s << " INFSNZ>" ;
    break ;
  case enum_IORWF:
    s << " IORWF>" ;
    break ;
  case enum_MOVF:
    s << " MOVF>" ;
    break ;
  case enum_RLCF:
    s << " RLCF>" ;
    break ;
  case enum_RLNCF:
    s << " RLNCF>" ;
    break ;
  case enum_RRCF:
    s << " RRCF>" ;
    break ;
  case enum_RRNCF:
    s << " RRNCF>" ;
    break ;
  case enum_SUBFWB:
    s << " SUBFWB>" ;
    break ;
  case enum_SUBWF:
    s << " SUBWF>" ;
    break ;
  case enum_SUBWFB:
    s << " SUBWFB>" ;
    break ;
  case enum_SWAPF:
    s << " SWAPF>" ;
    break ;
  case enum_XORWF:
    s << " XORWF>" ;
    break ;
  case kNotBuilt:
    s << " (not built)>" ;
    break ;
  }
  return GGS_string (true, s) ;
}

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_FDA_base_code::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_FDA_base_code * p = NULL ;
    macroMyNew (p, GGS_instruction_FDA_base_code (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_FDA_base_code GGS_instruction_FDA_base_code::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_FDA_base_code result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_FDA_base_code * p = dynamic_cast <const GGS_instruction_FDA_base_code *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_FDA_base_code, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_FDA_base_code::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_FDA_base_code ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//          Implementation of routine "getFDAinstructionBaseCode"            *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_getFDAinstructionBaseCode (C_Compiler &,
                                const GGS_instruction_FDA_base_code  var_cas_inInstruction,
                                GGS_uint  & var_cas_outBaseCode COMMA_UNUSED_LOCATION_ARGS) {
  #ifdef DEBUG_TRACE_ENABLED
    printf ("ENTER routine_getFDAinstructionBaseCode at %s:%d\n", __FILE__, __LINE__) ;
  #endif
  switch (var_cas_inInstruction.enumValue ()) {
  case GGS_instruction_FDA_base_code::enum_ADDWF:
    {
    var_cas_outBaseCode = GGS_uint (9216U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_ADDWFC:
    {
    var_cas_outBaseCode = GGS_uint (8192U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_ANDWF:
    {
    var_cas_outBaseCode = GGS_uint (5120U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_COMF:
    {
    var_cas_outBaseCode = GGS_uint (7168U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_DECF:
    {
    var_cas_outBaseCode = GGS_uint (1024U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_DECFSZ:
    {
    var_cas_outBaseCode = GGS_uint (11264U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_DCFSNZ:
    {
    var_cas_outBaseCode = GGS_uint (19456U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_INCF:
    {
    var_cas_outBaseCode = GGS_uint (10240U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_INCFSZ:
    {
    var_cas_outBaseCode = GGS_uint (15360U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_INFSNZ:
    {
    var_cas_outBaseCode = GGS_uint (18432U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_IORWF:
    {
    var_cas_outBaseCode = GGS_uint (4096U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_MOVF:
    {
    var_cas_outBaseCode = GGS_uint (20480U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_RLCF:
    {
    var_cas_outBaseCode = GGS_uint (13312U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_RLNCF:
    {
    var_cas_outBaseCode = GGS_uint (17408U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_RRCF:
    {
    var_cas_outBaseCode = GGS_uint (12288U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_RRNCF:
    {
    var_cas_outBaseCode = GGS_uint (16384U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_SUBFWB:
    {
    var_cas_outBaseCode = GGS_uint (21504U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_SUBWF:
    {
    var_cas_outBaseCode = GGS_uint (23552U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_SUBWFB:
    {
    var_cas_outBaseCode = GGS_uint (22528U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_SWAPF:
    {
    var_cas_outBaseCode = GGS_uint (14336U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::enum_XORWF:
    {
    var_cas_outBaseCode = GGS_uint (6144U) ;
    }
    break ;
  case GGS_instruction_FDA_base_code::kNotBuilt:
    break ;
  }
  #ifdef DEBUG_TRACE_ENABLED
    printf ("LEAVE routine_getFDAinstructionBaseCode\n") ;
  #endif
}

//---------------------------------------------------------------------------*
//                                                                           *
//                       class 'cPtr_instruction_FDA'                        *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_FDA::
cPtr_instruction_FDA (const GGS_location & argument_0,
                                const GGS_instruction_FDA_base_code& argument_1,
                                const GGS_registerExpression & argument_2,
                                const GGS_bool& argument_3
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mInstruction_FDA_base_code (argument_1),
mRegisterExpression (argument_2),
m_W_isDestination (argument_3) {
}

//---------------------------------------------------------------------------*

