pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_registerExpression  GGS_instruction_FDA::
reader_mRegisterExpression (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_registerExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_FDA *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_FDA *) mPointer)->mRegisterExpression ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_FDA::
reader_m_W_isDestination (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_bool  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_FDA *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_FDA *) mPointer)->m_W_isDestination ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_FDA::actualTypeName (void) const {
  return "instruction_FDA" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_FDA ("instruction_FDA", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_FDA) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_FDA::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_FDA * p = NULL ;
    macroMyNew (p, GGS_instruction_FDA (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_FDA GGS_instruction_FDA::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_FDA result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_FDA * p = dynamic_cast <const GGS_instruction_FDA *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_FDA, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_FDA::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_FDA ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             Class for 'FA_instruction_base_code' Enumeration              *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_FA_instruction_base_code ("FA_instruction_base_code", false, NULL) ;

//---------------------------------------------------------------------------*

bool GGS_FA_instruction_base_code::
isBuilt (void) const {
  return mValue > kNotBuilt ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_FA_instruction_base_code::
operator_isEqual (const GGS_FA_instruction_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue == inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_FA_instruction_base_code::
operator_isNotEqual (const GGS_FA_instruction_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue != inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_FA_instruction_base_code::
operator_infOrEqual (const GGS_FA_instruction_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue <= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_FA_instruction_base_code::
operator_supOrEqual (const GGS_FA_instruction_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue >= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_FA_instruction_base_code::
operator_strictInf (const GGS_FA_instruction_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue < inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_FA_instruction_base_code::
operator_strictSup (const GGS_FA_instruction_base_code inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue > inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_FA_instruction_base_code::
reader_mnemonic (C_Compiler & /* inLexique */
                       COMMA_UNUSED_LOCATION_ARGS) const {
  const char * kMessages [10] = {"",
    "CLRF",
    "CPFSEQ",
    "CPFSGT",
    "CPFSLT",
    "MOVWF",
    "MULWF",
    "NEGF",
    "SETF",
    "TSTFSZ"
  } ;
  return GGS_string (mValue > 0, kMessages [mValue]) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_FA_instruction_base_code::
reader_description (const PMSInt32 /* inIndentation */) const {
  C_String s ;
  s << "<enum @FA_instruction_base_code" ;
  switch (mValue) {
  case enum_CLRF:
    s << " CLRF>" ;
    break ;
  case enum_CPFSEQ:
    s << " CPFSEQ>" ;
    break ;
  case enum_CPFSGT:
    s << " CPFSGT>" ;
    break ;
  case enum_CPFSLT:
    s << " CPFSLT>" ;
    break ;
  case enum_MOVWF:
    s << " MOVWF>" ;
    break ;
  case enum_MULWF:
    s << " MULWF>" ;
    break ;
  case enum_NEGF:
    s << " NEGF>" ;
    break ;
  case enum_SETF:
    s << " SETF>" ;
    break ;
  case enum_TSTFSZ:
    s << " TSTFSZ>" ;
    break ;
  case kNotBuilt:
    s << " (not built)>" ;
    break ;
  }
  return GGS_string (true, s) ;
}

//---------------------------------------------------------------------------*

