pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_bit_oriented_op GGS_instruction_FBA::
reader_mBitOrientedOp (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_bit_oriented_op  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_FBA *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_FBA *) mPointer)->mBitOrientedOp ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerExpression  GGS_instruction_FBA::
reader_mRegisterExpression (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_registerExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_FBA *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_FBA *) mPointer)->mRegisterExpression ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bitNumberExpression  GGS_instruction_FBA::
reader_mBitNumber (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_bitNumberExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_FBA *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_FBA *) mPointer)->mBitNumber ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_FBA::actualTypeName (void) const {
  return "instruction_FBA" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_FBA ("instruction_FBA", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_FBA) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_FBA::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_FBA * p = NULL ;
    macroMyNew (p, GGS_instruction_FBA (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_FBA GGS_instruction_FBA::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_FBA result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_FBA * p = dynamic_cast <const GGS_instruction_FBA *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_FBA, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_FBA::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_FBA ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                Class for 'conditional_branch' Enumeration                 *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_conditional_branch ("conditional_branch", false, NULL) ;

//---------------------------------------------------------------------------*

bool GGS_conditional_branch::
isBuilt (void) const {
  return mValue > kNotBuilt ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_conditional_branch::
operator_isEqual (const GGS_conditional_branch inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue == inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_conditional_branch::
operator_isNotEqual (const GGS_conditional_branch inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue != inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_conditional_branch::
operator_infOrEqual (const GGS_conditional_branch inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue <= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_conditional_branch::
operator_supOrEqual (const GGS_conditional_branch inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue >= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_conditional_branch::
operator_strictInf (const GGS_conditional_branch inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue < inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_conditional_branch::
operator_strictSup (const GGS_conditional_branch inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue > inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_conditional_branch::
reader_mnemonic (C_Compiler & /* inLexique */
                       COMMA_UNUSED_LOCATION_ARGS) const {
  const char * kMessages [9] = {"",
    "BC",
    "BN",
    "BNC",
    "BNN",
    "BNOV",
    "BNZ",
    "BOV",
    "BZ"
  } ;
  return GGS_string (mValue > 0, kMessages [mValue]) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_conditional_branch::
reader_condition (C_Compiler & /* inLexique */
                       COMMA_UNUSED_LOCATION_ARGS) const {
  const char * kMessages [9] = {"",
    "C",
    "N",
    "NC",
    "NN",
    "NOV",
    "NZ",
    "OV",
    "Z"
  } ;
  return GGS_string (mValue > 0, kMessages [mValue]) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_conditional_branch::
reader_description (const PMSInt32 /* inIndentation */) const {
  C_String s ;
  s << "<enum @conditional_branch" ;
  switch (mValue) {
  case enum_bc:
    s << " bc>" ;
    break ;
  case enum_bn:
    s << " bn>" ;
    break ;
  case enum_bnc:
    s << " bnc>" ;
    break ;
  case enum_bnn:
    s << " bnn>" ;
    break ;
  case enum_bnov:
    s << " bnov>" ;
    break ;
  case enum_bnz:
    s << " bnz>" ;
    break ;
  case enum_bov:
    s << " bov>" ;
    break ;
  case enum_bz:
    s << " bz>" ;
    break ;
  case kNotBuilt:
    s << " (not built)>" ;
    break ;
  }
  return GGS_string (true, s) ;
}

//---------------------------------------------------------------------------*

GGS_object GGS_conditional_branch::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_conditional_branch * p = NULL ;
    macroMyNew (p, GGS_conditional_branch (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_conditional_branch GGS_conditional_branch::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_conditional_branch result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_conditional_branch * p = dynamic_cast <const GGS_conditional_branch *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_conditional_branch, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_conditional_branch::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_conditional_branch ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             Implementation of routine "getComplementaryBcc"               *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_getComplementaryBcc (C_Compiler & inLexique,
                                const GGS_conditional_branch  var_cas_inConditionalBranch,
                                GGS_conditional_branch & var_cas_outComplementary COMMA_UNUSED_LOCATION_ARGS) {
  #ifdef DEBUG_TRACE_ENABLED
    printf ("ENTER routine_getComplementaryBcc at %s:%d\n", __FILE__, __LINE__) ;
  #endif
  switch (var_cas_inConditionalBranch.enumValue ()) {
  case GGS_conditional_branch::enum_bz:
    {
    var_cas_outComplementary = GGS_conditional_branch::constructor_bnz (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_conditional_branch::enum_bnz:
    {
    var_cas_outComplementary = GGS_conditional_branch::constructor_bz (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_conditional_branch::enum_bn:
    {
    var_cas_outComplementary = GGS_conditional_branch::constructor_bnn (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_conditional_branch::enum_bnn:
    {
    var_cas_outComplementary = GGS_conditional_branch::constructor_bn (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_conditional_branch::enum_bc:
    {
    var_cas_outComplementary = GGS_conditional_branch::constructor_bnc (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_conditional_branch::enum_bnc:
    {
    var_cas_outComplementary = GGS_conditional_branch::constructor_bc (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_conditional_branch::enum_bov:
    {
    var_cas_outComplementary = GGS_conditional_branch::constructor_bnov (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_conditional_branch::enum_bnov:
    {
    var_cas_outComplementary = GGS_conditional_branch::constructor_bov (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_conditional_branch::kNotBuilt:
    break ;
  }
  #ifdef DEBUG_TRACE_ENABLED
    printf ("LEAVE routine_getComplementaryBcc\n") ;
  #endif
}

//---------------------------------------------------------------------------*
//                                                                           *
//               Class for 'jumpInstructionKind' Enumeration                 *
//                                                                           *
//---------------------------------------------------------------------------*

