pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_instruction_JUMP GGS_instruction_JUMP::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_location & argument_0,
                 const GGS_lstring & argument_1,
                 const GGS_jumpInstructionKind& argument_2
                                COMMA_LOCATION_ARGS) {
  GGS_instruction_JUMP result ;
  macroMyNew (result.mPointer, cPtr_instruction_JUMP (argument_0,
                                argument_1,
                                argument_2 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_lstring  GGS_instruction_JUMP::
reader_mTargetLabel (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_lstring   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_JUMP *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_JUMP *) mPointer)->mTargetLabel ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_jumpInstructionKind GGS_instruction_JUMP::
reader_mKind (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_jumpInstructionKind  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_JUMP *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_JUMP *) mPointer)->mKind ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_JUMP::actualTypeName (void) const {
  return "instruction_JUMP" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_JUMP ("instruction_JUMP", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_JUMP) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_JUMP::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_JUMP * p = NULL ;
    macroMyNew (p, GGS_instruction_JUMP (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_JUMP GGS_instruction_JUMP::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_JUMP result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_JUMP * p = dynamic_cast <const GGS_instruction_JUMP *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_JUMP, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_JUMP::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_JUMP ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                     class 'cPtr_instruction_JUMPCC'                       *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_JUMPCC::
cPtr_instruction_JUMPCC (const GGS_location & argument_0,
                                const GGS_lstring & argument_1,
                                const GGS_conditional_branch& argument_2,
                                const GGS_bool& argument_3
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mTargetLabel (argument_1),
mConditionalBranch (argument_2),
mIsBcc (argument_3) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_JUMPCC * GGS_instruction_JUMPCC::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_JUMPCC *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_JUMPCC *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_instruction_JUMPCC::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_instruction_JUMPCC * ptr = dynamic_cast <const cPtr_instruction_JUMPCC *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mInstructionLocation.operator_isEqual (ptr->mInstructionLocation).boolValue ()
         && mTargetLabel.operator_isEqual (ptr->mTargetLabel).boolValue ()
         && mConditionalBranch.operator_isEqual (ptr->mConditionalBranch).boolValue ()
         && mIsBcc.operator_isEqual (ptr->mIsBcc).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_instruction_JUMPCC::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_JUMPCC:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mTargetLabel.reader_description (inIndentation + 1)
           << mConditionalBranch.reader_description (inIndentation + 1)
           << mIsBcc.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_instruction_JUMPCC::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_instruction_JUMPCC::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_instruction_JUMPCC (& typeid (cPtr_instruction_JUMPCC), & typeid (cPtr_piccolo_instruction), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_instruction_JUMPCC::galgasRTTI (void) const {
  return & gClassInfoFor__instruction_JUMPCC ;
}

//---------------------------------------------------------------------------*

