pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
cPtr__AC_galgas_class * cPtr_instruction_JUMPCC::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_instruction_JUMPCC (mInstructionLocation, mTargetLabel, mConditionalBranch, mIsBcc COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                  GALGAS class 'GGS_instruction_JUMPCC'                    *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_instruction_JUMPCC ("instruction_JUMPCC", true, & kTypeDescriptor_GGS_piccolo_instruction) ;

//---------------------------------------------------------------------------*

GGS_instruction_JUMPCC::
GGS_instruction_JUMPCC (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_instruction_JUMPCC::
GGS_instruction_JUMPCC (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_instruction_JUMPCC GGS_instruction_JUMPCC::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_instruction_JUMPCC result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_instruction_JUMPCC *> (inPointer) != NULL)
      : (typeid (cPtr_instruction_JUMPCC) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_instruction_JUMPCC (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_instruction_JUMPCC),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_JUMPCC GGS_instruction_JUMPCC::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_location & argument_0,
                 const GGS_lstring & argument_1,
                 const GGS_conditional_branch& argument_2,
                 const GGS_bool& argument_3
                                COMMA_LOCATION_ARGS) {
  GGS_instruction_JUMPCC result ;
  macroMyNew (result.mPointer, cPtr_instruction_JUMPCC (argument_0,
                                argument_1,
                                argument_2,
                                argument_3 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_lstring  GGS_instruction_JUMPCC::
reader_mTargetLabel (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_lstring   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_JUMPCC *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_JUMPCC *) mPointer)->mTargetLabel ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_conditional_branch GGS_instruction_JUMPCC::
reader_mConditionalBranch (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_conditional_branch  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_JUMPCC *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_JUMPCC *) mPointer)->mConditionalBranch ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_JUMPCC::
reader_mIsBcc (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_bool  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_JUMPCC *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_JUMPCC *) mPointer)->mIsBcc ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_JUMPCC::actualTypeName (void) const {
  return "instruction_JUMPCC" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_JUMPCC ("instruction_JUMPCC", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_JUMPCC) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_JUMPCC::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_JUMPCC * p = NULL ;
    macroMyNew (p, GGS_instruction_JUMPCC (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_JUMPCC GGS_instruction_JUMPCC::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_JUMPCC result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_JUMPCC * p = dynamic_cast <const GGS_instruction_JUMPCC *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_JUMPCC, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_JUMPCC::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_JUMPCC ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                     class 'cPtr_instruction_CLRWDT'                       *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_CLRWDT::
cPtr_instruction_CLRWDT (const GGS_location & argument_0
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE) {
}

//---------------------------------------------------------------------------*

