pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
const C_galgas_type_descriptorEX * GGS_instruction_SLEEP::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_SLEEP ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//            Class for 'literal_instruction_opcode' Enumeration             *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_literal_instruction_opcode ("literal_instruction_opcode", false, NULL) ;

//---------------------------------------------------------------------------*

bool GGS_literal_instruction_opcode::
isBuilt (void) const {
  return mValue > kNotBuilt ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_literal_instruction_opcode::
operator_isEqual (const GGS_literal_instruction_opcode inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue == inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_literal_instruction_opcode::
operator_isNotEqual (const GGS_literal_instruction_opcode inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue != inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_literal_instruction_opcode::
operator_infOrEqual (const GGS_literal_instruction_opcode inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue <= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_literal_instruction_opcode::
operator_supOrEqual (const GGS_literal_instruction_opcode inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue >= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_literal_instruction_opcode::
operator_strictInf (const GGS_literal_instruction_opcode inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue < inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_literal_instruction_opcode::
operator_strictSup (const GGS_literal_instruction_opcode inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue > inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_literal_instruction_opcode::
reader_mnemonic (C_Compiler & /* inLexique */
                       COMMA_UNUSED_LOCATION_ARGS) const {
  const char * kMessages [9] = {"",
    "ADDLW",
    "ANDLW",
    "IORLW",
    "MOVLW",
    "MULLW",
    "RETLW",
    "SUBLW",
    "XORLW"
  } ;
  return GGS_string (mValue > 0, kMessages [mValue]) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_literal_instruction_opcode::
reader_description (const PMSInt32 /* inIndentation */) const {
  C_String s ;
  s << "<enum @literal_instruction_opcode" ;
  switch (mValue) {
  case enum_ADDLW:
    s << " ADDLW>" ;
    break ;
  case enum_ANDLW:
    s << " ANDLW>" ;
    break ;
  case enum_IORLW:
    s << " IORLW>" ;
    break ;
  case enum_MOVLW:
    s << " MOVLW>" ;
    break ;
  case enum_MULLW:
    s << " MULLW>" ;
    break ;
  case enum_RETLW:
    s << " RETLW>" ;
    break ;
  case enum_SUBLW:
    s << " SUBLW>" ;
    break ;
  case enum_XORLW:
    s << " XORLW>" ;
    break ;
  case kNotBuilt:
    s << " (not built)>" ;
    break ;
  }
  return GGS_string (true, s) ;
}

//---------------------------------------------------------------------------*

GGS_object GGS_literal_instruction_opcode::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_literal_instruction_opcode * p = NULL ;
    macroMyNew (p, GGS_literal_instruction_opcode (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_literal_instruction_opcode GGS_literal_instruction_opcode::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_literal_instruction_opcode result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_literal_instruction_opcode * p = dynamic_cast <const GGS_literal_instruction_opcode *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_literal_instruction_opcode, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_literal_instruction_opcode::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_literal_instruction_opcode ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                class 'cPtr_instruction_literalOperation'                  *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_literalOperation::
cPtr_instruction_literalOperation (const GGS_location & argument_0,
                                const GGS_literal_instruction_opcode& argument_1,
                                const GGS_immediatExpression & argument_2
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mLiteralInstruction (argument_1),
mImmediatExpression (argument_2) {
}

//---------------------------------------------------------------------------*

