pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_instruction_FOREVER GGS_instruction_FOREVER::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_FOREVER result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_FOREVER * p = dynamic_cast <const GGS_instruction_FOREVER *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_FOREVER, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_FOREVER::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_FOREVER ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                 Class for 'if_semi_colon_op' Enumeration                  *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_if_semi_colon_op ("if_semi_colon_op", false, NULL) ;

//---------------------------------------------------------------------------*

bool GGS_if_semi_colon_op::
isBuilt (void) const {
  return mValue > kNotBuilt ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_if_semi_colon_op::
operator_isEqual (const GGS_if_semi_colon_op inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue == inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_if_semi_colon_op::
operator_isNotEqual (const GGS_if_semi_colon_op inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue != inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_if_semi_colon_op::
operator_infOrEqual (const GGS_if_semi_colon_op inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue <= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_if_semi_colon_op::
operator_supOrEqual (const GGS_if_semi_colon_op inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue >= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_if_semi_colon_op::
operator_strictInf (const GGS_if_semi_colon_op inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue < inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_if_semi_colon_op::
operator_strictSup (const GGS_if_semi_colon_op inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue > inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_if_semi_colon_op::
reader_mnemonic (C_Compiler & /* inLexique */
                       COMMA_UNUSED_LOCATION_ARGS) const {
  const char * kMessages [5] = {"",
    "CPFSEQ",
    "CPFSGT",
    "CPFSLT",
    "TSTFSZ"
  } ;
  return GGS_string (mValue > 0, kMessages [mValue]) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_if_semi_colon_op::
reader_description (const PMSInt32 /* inIndentation */) const {
  C_String s ;
  s << "<enum @if_semi_colon_op" ;
  switch (mValue) {
  case enum_CPFSEQ:
    s << " CPFSEQ>" ;
    break ;
  case enum_CPFSGT:
    s << " CPFSGT>" ;
    break ;
  case enum_CPFSLT:
    s << " CPFSLT>" ;
    break ;
  case enum_TSTFSZ:
    s << " TSTFSZ>" ;
    break ;
  case kNotBuilt:
    s << " (not built)>" ;
    break ;
  }
  return GGS_string (true, s) ;
}

//---------------------------------------------------------------------------*

GGS_object GGS_if_semi_colon_op::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_if_semi_colon_op * p = NULL ;
    macroMyNew (p, GGS_if_semi_colon_op (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_if_semi_colon_op GGS_if_semi_colon_op::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_if_semi_colon_op result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_if_semi_colon_op * p = dynamic_cast <const GGS_if_semi_colon_op *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_if_semi_colon_op, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_if_semi_colon_op::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_if_semi_colon_op ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                  class 'cPtr_instruction_IF_SEMI_COLON'                   *
//                                                                           *
//---------------------------------------------------------------------------*

