pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
cPtr_instruction_IF_SEMI_COLON::
cPtr_instruction_IF_SEMI_COLON (const GGS_location & argument_0,
                                const GGS_piccolo_instruction & argument_1
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mInstruction (argument_1) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_IF_SEMI_COLON * GGS_instruction_IF_SEMI_COLON::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_SEMI_COLON *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_IF_SEMI_COLON *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

void cPtr_instruction_IF_SEMI_COLON::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_IF_SEMI_COLON:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mInstruction.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_instruction_IF_SEMI_COLON::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_instruction_IF_SEMI_COLON::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_instruction_IF_SEMI_COLON (& typeid (cPtr_instruction_IF_SEMI_COLON), & typeid (cPtr_piccolo_instruction), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_instruction_IF_SEMI_COLON::galgasRTTI (void) const {
  return & gClassInfoFor__instruction_IF_SEMI_COLON ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//               GALGAS class 'GGS_instruction_IF_SEMI_COLON'                *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_instruction_IF_SEMI_COLON ("instruction_IF_SEMI_COLON", true, & kTypeDescriptor_GGS_piccolo_instruction) ;

//---------------------------------------------------------------------------*

GGS_instruction_IF_SEMI_COLON::
GGS_instruction_IF_SEMI_COLON (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_instruction_IF_SEMI_COLON::
GGS_instruction_IF_SEMI_COLON (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_instruction_IF_SEMI_COLON GGS_instruction_IF_SEMI_COLON::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_instruction_IF_SEMI_COLON result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_instruction_IF_SEMI_COLON *> (inPointer) != NULL)
      : (typeid (cPtr_instruction_IF_SEMI_COLON) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_instruction_IF_SEMI_COLON (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_instruction_IF_SEMI_COLON),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_piccolo_instruction  GGS_instruction_IF_SEMI_COLON::
reader_mInstruction (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_piccolo_instruction   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_SEMI_COLON *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_IF_SEMI_COLON *) mPointer)->mInstruction ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_IF_SEMI_COLON::actualTypeName (void) const {
  return "instruction_IF_SEMI_COLON" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_IF_SEMI_COLON ("instruction_IF_SEMI_COLON", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_IF_SEMI_COLON) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_IF_SEMI_COLON::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_IF_SEMI_COLON * p = NULL ;
    macroMyNew (p, GGS_instruction_IF_SEMI_COLON (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_IF_SEMI_COLON GGS_instruction_IF_SEMI_COLON::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_IF_SEMI_COLON result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_IF_SEMI_COLON * p = dynamic_cast <const GGS_instruction_IF_SEMI_COLON *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_IF_SEMI_COLON, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_IF_SEMI_COLON::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_IF_SEMI_COLON ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                class 'cPtr_instruction_IF_FA_SEMI_COLON'                  *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_IF_FA_SEMI_COLON::
cPtr_instruction_IF_FA_SEMI_COLON (const GGS_location & argument_0,
                                const GGS_piccolo_instruction & argument_1,
                                const GGS_if_semi_colon_op& argument_2,
                                const GGS_registerExpression & argument_3
                                COMMA_LOCATION_ARGS)
:cPtr_instruction_IF_SEMI_COLON (argument_0, argument_1 COMMA_THERE),
mOpCode (argument_2),
mRegisterExpression (argument_3) {
}

//---------------------------------------------------------------------------*

