pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_IF_FA_SEMI_COLON * GGS_instruction_IF_FA_SEMI_COLON::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_FA_SEMI_COLON *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_IF_FA_SEMI_COLON *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_instruction_IF_FA_SEMI_COLON::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_instruction_IF_FA_SEMI_COLON * ptr = dynamic_cast <const cPtr_instruction_IF_FA_SEMI_COLON *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mInstructionLocation.operator_isEqual (ptr->mInstructionLocation).boolValue ()
         && mInstruction.operator_isEqual (ptr->mInstruction).boolValue ()
         && mOpCode.operator_isEqual (ptr->mOpCode).boolValue ()
         && mRegisterExpression.operator_isEqual (ptr->mRegisterExpression).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_instruction_IF_FA_SEMI_COLON::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_IF_FA_SEMI_COLON:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mInstruction.reader_description (inIndentation + 1)
           << mOpCode.reader_description (inIndentation + 1)
           << mRegisterExpression.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_instruction_IF_FA_SEMI_COLON::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_instruction_IF_FA_SEMI_COLON::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_instruction_IF_FA_SEMI_COLON (& typeid (cPtr_instruction_IF_FA_SEMI_COLON), & typeid (cPtr_instruction_IF_SEMI_COLON), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_instruction_IF_FA_SEMI_COLON::galgasRTTI (void) const {
  return & gClassInfoFor__instruction_IF_FA_SEMI_COLON ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_instruction_IF_FA_SEMI_COLON::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_instruction_IF_FA_SEMI_COLON (mInstructionLocation, mInstruction, mOpCode, mRegisterExpression COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             GALGAS class 'GGS_instruction_IF_FA_SEMI_COLON'               *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_instruction_IF_FA_SEMI_COLON ("instruction_IF_FA_SEMI_COLON", true, & kTypeDescriptor_GGS_instruction_IF_SEMI_COLON) ;

//---------------------------------------------------------------------------*

GGS_instruction_IF_FA_SEMI_COLON::
GGS_instruction_IF_FA_SEMI_COLON (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_instruction_IF_FA_SEMI_COLON::
GGS_instruction_IF_FA_SEMI_COLON (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_instruction_IF_FA_SEMI_COLON GGS_instruction_IF_FA_SEMI_COLON::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_instruction_IF_FA_SEMI_COLON result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_instruction_IF_FA_SEMI_COLON *> (inPointer) != NULL)
      : (typeid (cPtr_instruction_IF_FA_SEMI_COLON) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_instruction_IF_FA_SEMI_COLON (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_instruction_IF_FA_SEMI_COLON),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_IF_FA_SEMI_COLON GGS_instruction_IF_FA_SEMI_COLON::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_location & argument_0,
                 const GGS_piccolo_instruction & argument_1,
                 const GGS_if_semi_colon_op& argument_2,
                 const GGS_registerExpression & argument_3
                                COMMA_LOCATION_ARGS) {
  GGS_instruction_IF_FA_SEMI_COLON result ;
  macroMyNew (result.mPointer, cPtr_instruction_IF_FA_SEMI_COLON (argument_0,
                                argument_1,
                                argument_2,
                                argument_3 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_if_semi_colon_op GGS_instruction_IF_FA_SEMI_COLON::
reader_mOpCode (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_if_semi_colon_op  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_FA_SEMI_COLON *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_IF_FA_SEMI_COLON *) mPointer)->mOpCode ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerExpression  GGS_instruction_IF_FA_SEMI_COLON::
reader_mRegisterExpression (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_registerExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_FA_SEMI_COLON *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_IF_FA_SEMI_COLON *) mPointer)->mRegisterExpression ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_IF_FA_SEMI_COLON::actualTypeName (void) const {
  return "instruction_IF_FA_SEMI_COLON" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_IF_FA_SEMI_COLON ("instruction_IF_FA_SEMI_COLON", gClassInfoFor__instruction_IF_SEMI_COLON, & kTypeDescriptor_GGS_instruction_IF_FA_SEMI_COLON) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_IF_FA_SEMI_COLON::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_IF_FA_SEMI_COLON * p = NULL ;
    macroMyNew (p, GGS_instruction_IF_FA_SEMI_COLON (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_IF_FA_SEMI_COLON GGS_instruction_IF_FA_SEMI_COLON::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_IF_FA_SEMI_COLON result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_IF_FA_SEMI_COLON * p = dynamic_cast <const GGS_instruction_IF_FA_SEMI_COLON *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_IF_FA_SEMI_COLON, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_IF_FA_SEMI_COLON::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_IF_FA_SEMI_COLON ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                   class 'cPtr_instruction_IF_BitTest'                     *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_IF_BitTest::
cPtr_instruction_IF_BitTest (const GGS_location & argument_0,
                                const GGS_piccolo_instruction & argument_1,
                                const GGS_bool& argument_2,
                                const GGS_registerExpression & argument_3,
                                const GGS_bitNumberExpression & argument_4
                                COMMA_LOCATION_ARGS)
:cPtr_instruction_IF_SEMI_COLON (argument_0, argument_1 COMMA_THERE),
mSkipIfSet (argument_2),
mRegisterExpression (argument_3),
mBitNumber (argument_4) {
}

//---------------------------------------------------------------------------*

