pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_IF_BitTest * GGS_instruction_IF_BitTest::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_BitTest *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_IF_BitTest *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_instruction_IF_BitTest::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_instruction_IF_BitTest * ptr = dynamic_cast <const cPtr_instruction_IF_BitTest *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mInstructionLocation.operator_isEqual (ptr->mInstructionLocation).boolValue ()
         && mInstruction.operator_isEqual (ptr->mInstruction).boolValue ()
         && mSkipIfSet.operator_isEqual (ptr->mSkipIfSet).boolValue ()
         && mRegisterExpression.operator_isEqual (ptr->mRegisterExpression).boolValue ()
         && mBitNumber.operator_isEqual (ptr->mBitNumber).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_instruction_IF_BitTest::
method_getBaseCode (C_Compiler & /* inLexique */,
                                GGS_uint & var_cas_outBaseCode COMMA_UNUSED_LOCATION_ARGS) const {
  const GGS_bool cond_11074 = mSkipIfSet ;
  if (cond_11074.isBuiltAndTrue ()) {
    var_cas_outBaseCode = GGS_uint (40960U) ;
  }else if (cond_11074.isBuiltAndFalse ()) {
    var_cas_outBaseCode = GGS_uint (45056U) ;
  }
}

//---------------------------------------------------------------------------*

void cPtr_instruction_IF_BitTest::
method_getMnemonic (C_Compiler & /* inLexique */,
                                GGS_string& var_cas_outMnemonic COMMA_UNUSED_LOCATION_ARGS) const {
  const GGS_bool cond_11249 = mSkipIfSet ;
  if (cond_11249.isBuiltAndTrue ()) {
    var_cas_outMnemonic = GGS_string ("BTFSS") ;
  }else if (cond_11249.isBuiltAndFalse ()) {
    var_cas_outMnemonic = GGS_string ("BTFSC") ;
  }
}

//---------------------------------------------------------------------------*

void cPtr_instruction_IF_BitTest::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_IF_BitTest:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mInstruction.reader_description (inIndentation + 1)
           << mSkipIfSet.reader_description (inIndentation + 1)
           << mRegisterExpression.reader_description (inIndentation + 1)
           << mBitNumber.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_instruction_IF_BitTest::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_instruction_IF_BitTest::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_instruction_IF_BitTest (& typeid (cPtr_instruction_IF_BitTest), & typeid (cPtr_instruction_IF_SEMI_COLON), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_instruction_IF_BitTest::galgasRTTI (void) const {
  return & gClassInfoFor__instruction_IF_BitTest ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_instruction_IF_BitTest::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_instruction_IF_BitTest (mInstructionLocation, mInstruction, mSkipIfSet, mRegisterExpression, mBitNumber COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                GALGAS class 'GGS_instruction_IF_BitTest'                  *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_instruction_IF_BitTest ("instruction_IF_BitTest", true, & kTypeDescriptor_GGS_instruction_IF_SEMI_COLON) ;

//---------------------------------------------------------------------------*

GGS_instruction_IF_BitTest::
GGS_instruction_IF_BitTest (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_instruction_IF_BitTest::
GGS_instruction_IF_BitTest (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_instruction_IF_BitTest GGS_instruction_IF_BitTest::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_instruction_IF_BitTest result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_instruction_IF_BitTest *> (inPointer) != NULL)
      : (typeid (cPtr_instruction_IF_BitTest) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_instruction_IF_BitTest (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_instruction_IF_BitTest),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_IF_BitTest GGS_instruction_IF_BitTest::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_location & argument_0,
                 const GGS_piccolo_instruction & argument_1,
                 const GGS_bool& argument_2,
                 const GGS_registerExpression & argument_3,
                 const GGS_bitNumberExpression & argument_4
                                COMMA_LOCATION_ARGS) {
  GGS_instruction_IF_BitTest result ;
  macroMyNew (result.mPointer, cPtr_instruction_IF_BitTest (argument_0,
                                argument_1,
                                argument_2,
                                argument_3,
                                argument_4 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_IF_BitTest::
reader_mSkipIfSet (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_bool  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_BitTest *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_IF_BitTest *) mPointer)->mSkipIfSet ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

