pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_registerExpression  GGS_instruction_IF_BitTest::
reader_mRegisterExpression (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_registerExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_BitTest *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_IF_BitTest *) mPointer)->mRegisterExpression ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bitNumberExpression  GGS_instruction_IF_BitTest::
reader_mBitNumber (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_bitNumberExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_BitTest *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_IF_BitTest *) mPointer)->mBitNumber ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_IF_BitTest::actualTypeName (void) const {
  return "instruction_IF_BitTest" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_IF_BitTest ("instruction_IF_BitTest", gClassInfoFor__instruction_IF_SEMI_COLON, & kTypeDescriptor_GGS_instruction_IF_BitTest) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_IF_BitTest::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_IF_BitTest * p = NULL ;
    macroMyNew (p, GGS_instruction_IF_BitTest (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_IF_BitTest GGS_instruction_IF_BitTest::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_IF_BitTest result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_IF_BitTest * p = dynamic_cast <const GGS_instruction_IF_BitTest *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_IF_BitTest, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_IF_BitTest::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_IF_BitTest ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                    class 'cPtr_instruction_IF_IncDec'                     *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_IF_IncDec::
cPtr_instruction_IF_IncDec (const GGS_location & argument_0,
                                const GGS_piccolo_instruction & argument_1,
                                const GGS_bool& argument_2,
                                const GGS_bool& argument_3,
                                const GGS_registerExpression & argument_4,
                                const GGS_bool& argument_5
                                COMMA_LOCATION_ARGS)
:cPtr_instruction_IF_SEMI_COLON (argument_0, argument_1 COMMA_THERE),
mIncrement (argument_2),
mSkipIfZero (argument_3),
mRegisterExpression (argument_4),
m_W_isDestination (argument_5) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_IF_IncDec * GGS_instruction_IF_IncDec::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_IF_IncDec *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_IF_IncDec *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_instruction_IF_IncDec::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_instruction_IF_IncDec * ptr = dynamic_cast <const cPtr_instruction_IF_IncDec *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mInstructionLocation.operator_isEqual (ptr->mInstructionLocation).boolValue ()
         && mInstruction.operator_isEqual (ptr->mInstruction).boolValue ()
         && mIncrement.operator_isEqual (ptr->mIncrement).boolValue ()
         && mSkipIfZero.operator_isEqual (ptr->mSkipIfZero).boolValue ()
         && mRegisterExpression.operator_isEqual (ptr->mRegisterExpression).boolValue ()
         && m_W_isDestination.operator_isEqual (ptr->m_W_isDestination).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_instruction_IF_IncDec::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_IF_IncDec:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mInstruction.reader_description (inIndentation + 1)
           << mIncrement.reader_description (inIndentation + 1)
           << mSkipIfZero.reader_description (inIndentation + 1)
           << mRegisterExpression.reader_description (inIndentation + 1)
           << m_W_isDestination.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_instruction_IF_IncDec::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_instruction_IF_IncDec::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

