pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_IF_IncDec ("instruction_IF_IncDec", gClassInfoFor__instruction_IF_SEMI_COLON, & kTypeDescriptor_GGS_instruction_IF_IncDec) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_IF_IncDec::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_IF_IncDec * p = NULL ;
    macroMyNew (p, GGS_instruction_IF_IncDec (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_IF_IncDec GGS_instruction_IF_IncDec::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_IF_IncDec result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_IF_IncDec * p = dynamic_cast <const GGS_instruction_IF_IncDec *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_IF_IncDec, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_IF_IncDec::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_IF_IncDec ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                 class 'cPtr_instruction_computed_retlw'                   *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_computed_retlw::
cPtr_instruction_computed_retlw (const GGS_location & argument_0,
                                const GGS_immediatExpression & argument_1,
                                const GGS_immediatExpressionList & argument_2,
                                const GGS_bool& argument_3
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mSizeExpression (argument_1),
mImmediateExpressionList (argument_2),
mUsesRelativeCall (argument_3) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_computed_retlw * GGS_instruction_computed_retlw::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_computed_retlw *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_computed_retlw *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_instruction_computed_retlw::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_instruction_computed_retlw * ptr = dynamic_cast <const cPtr_instruction_computed_retlw *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mInstructionLocation.operator_isEqual (ptr->mInstructionLocation).boolValue ()
         && mSizeExpression.operator_isEqual (ptr->mSizeExpression).boolValue ()
         && mImmediateExpressionList.operator_isEqual (ptr->mImmediateExpressionList).boolValue ()
         && mUsesRelativeCall.operator_isEqual (ptr->mUsesRelativeCall).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_instruction_computed_retlw::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_computed_retlw:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mSizeExpression.reader_description (inIndentation + 1)
           << mImmediateExpressionList.reader_description (inIndentation + 1)
           << mUsesRelativeCall.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_instruction_computed_retlw::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_instruction_computed_retlw::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_instruction_computed_retlw (& typeid (cPtr_instruction_computed_retlw), & typeid (cPtr_piccolo_instruction), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_instruction_computed_retlw::galgasRTTI (void) const {
  return & gClassInfoFor__instruction_computed_retlw ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_instruction_computed_retlw::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_instruction_computed_retlw (mInstructionLocation, mSizeExpression, mImmediateExpressionList, mUsesRelativeCall COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              GALGAS class 'GGS_instruction_computed_retlw'                *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_instruction_computed_retlw ("instruction_computed_retlw", true, & kTypeDescriptor_GGS_piccolo_instruction) ;

//---------------------------------------------------------------------------*

GGS_instruction_computed_retlw::
GGS_instruction_computed_retlw (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_instruction_computed_retlw::
GGS_instruction_computed_retlw (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_instruction_computed_retlw GGS_instruction_computed_retlw::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_instruction_computed_retlw result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_instruction_computed_retlw *> (inPointer) != NULL)
      : (typeid (cPtr_instruction_computed_retlw) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_instruction_computed_retlw (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_instruction_computed_retlw),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_computed_retlw GGS_instruction_computed_retlw::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_location & argument_0,
                 const GGS_immediatExpression & argument_1,
                 const GGS_immediatExpressionList & argument_2,
                 const GGS_bool& argument_3
                                COMMA_LOCATION_ARGS) {
  GGS_instruction_computed_retlw result ;
  macroMyNew (result.mPointer, cPtr_instruction_computed_retlw (argument_0,
                                argument_1,
                                argument_2,
                                argument_3 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

