pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_immediatExpression  GGS_instruction_computed_retlw::
reader_mSizeExpression (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_immediatExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_computed_retlw *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_computed_retlw *) mPointer)->mSizeExpression ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_immediatExpressionList  GGS_instruction_computed_retlw::
reader_mImmediateExpressionList (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_immediatExpressionList   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_computed_retlw *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_computed_retlw *) mPointer)->mImmediateExpressionList ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_instruction_computed_retlw::
reader_mUsesRelativeCall (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_bool  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_computed_retlw *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_instruction_computed_retlw *) mPointer)->mUsesRelativeCall ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_instruction_computed_retlw::actualTypeName (void) const {
  return "instruction_computed_retlw" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_computed_retlw ("instruction_computed_retlw", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_computed_retlw) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_computed_retlw::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_computed_retlw * p = NULL ;
    macroMyNew (p, GGS_instruction_computed_retlw (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_computed_retlw GGS_instruction_computed_retlw::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_computed_retlw result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_computed_retlw * p = dynamic_cast <const GGS_instruction_computed_retlw *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_computed_retlw, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_computed_retlw::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_computed_retlw ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                  class 'cPtr_instruction_computed_bra'                    *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_computed_bra::
cPtr_instruction_computed_bra (const GGS_location & argument_0,
                                const GGS_immediatExpression & argument_1,
                                const GGS_lstringlist & argument_2,
                                const GGS_bool& argument_3
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mSizeExpression (argument_1),
mTargetLabels (argument_2),
mUsesRelativeCall (argument_3) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_computed_bra * GGS_instruction_computed_bra::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_computed_bra *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_computed_bra *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_instruction_computed_bra::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_instruction_computed_bra * ptr = dynamic_cast <const cPtr_instruction_computed_bra *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mInstructionLocation.operator_isEqual (ptr->mInstructionLocation).boolValue ()
         && mSizeExpression.operator_isEqual (ptr->mSizeExpression).boolValue ()
         && mTargetLabels.operator_isEqual (ptr->mTargetLabels).boolValue ()
         && mUsesRelativeCall.operator_isEqual (ptr->mUsesRelativeCall).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_instruction_computed_bra::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_computed_bra:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mSizeExpression.reader_description (inIndentation + 1)
           << mTargetLabels.reader_description (inIndentation + 1)
           << mUsesRelativeCall.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_instruction_computed_bra::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_instruction_computed_bra::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_instruction_computed_bra (& typeid (cPtr_instruction_computed_bra), & typeid (cPtr_piccolo_instruction), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_instruction_computed_bra::galgasRTTI (void) const {
  return & gClassInfoFor__instruction_computed_bra ;
}

//---------------------------------------------------------------------------*

