pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
const C_galgas_type_descriptorEX * GGS_instruction_computed_bra::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_computed_bra ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                  class 'cPtr_instruction_computed_goto'                   *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_computed_goto::
cPtr_instruction_computed_goto (const GGS_location & argument_0,
                                const GGS_immediatExpression & argument_1,
                                const GGS_lstringlist & argument_2,
                                const GGS_bool& argument_3
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mSizeExpression (argument_1),
mTargetLabels (argument_2),
mUsesRelativeCall (argument_3) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_computed_goto * GGS_instruction_computed_goto::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_computed_goto *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_computed_goto *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_instruction_computed_goto::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_instruction_computed_goto * ptr = dynamic_cast <const cPtr_instruction_computed_goto *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mInstructionLocation.operator_isEqual (ptr->mInstructionLocation).boolValue ()
         && mSizeExpression.operator_isEqual (ptr->mSizeExpression).boolValue ()
         && mTargetLabels.operator_isEqual (ptr->mTargetLabels).boolValue ()
         && mUsesRelativeCall.operator_isEqual (ptr->mUsesRelativeCall).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_instruction_computed_goto::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_computed_goto:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mSizeExpression.reader_description (inIndentation + 1)
           << mTargetLabels.reader_description (inIndentation + 1)
           << mUsesRelativeCall.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_instruction_computed_goto::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_instruction_computed_goto::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_instruction_computed_goto (& typeid (cPtr_instruction_computed_goto), & typeid (cPtr_piccolo_instruction), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_instruction_computed_goto::galgasRTTI (void) const {
  return & gClassInfoFor__instruction_computed_goto ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_instruction_computed_goto::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_instruction_computed_goto (mInstructionLocation, mSizeExpression, mTargetLabels, mUsesRelativeCall COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//               GALGAS class 'GGS_instruction_computed_goto'                *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_instruction_computed_goto ("instruction_computed_goto", true, & kTypeDescriptor_GGS_piccolo_instruction) ;

//---------------------------------------------------------------------------*

GGS_instruction_computed_goto::
GGS_instruction_computed_goto (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_instruction_computed_goto::
GGS_instruction_computed_goto (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_instruction_computed_goto GGS_instruction_computed_goto::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_instruction_computed_goto result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_instruction_computed_goto *> (inPointer) != NULL)
      : (typeid (cPtr_instruction_computed_goto) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_instruction_computed_goto (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_instruction_computed_goto),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_computed_goto GGS_instruction_computed_goto::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_location & argument_0,
                 const GGS_immediatExpression & argument_1,
                 const GGS_lstringlist & argument_2,
                 const GGS_bool& argument_3
                                COMMA_LOCATION_ARGS) {
  GGS_instruction_computed_goto result ;
  macroMyNew (result.mPointer, cPtr_instruction_computed_goto (argument_0,
                                argument_1,
                                argument_2,
                                argument_3 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

