pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
cPtr_registerTestCondition::
cPtr_registerTestCondition (const GGS_registerExpression & argument_0,
                                const GGS_bool& argument_1
                                COMMA_LOCATION_ARGS)
:cPtr_conditionExpression (THERE),
mRegisterExpression (argument_0),
mBranchIfZero (argument_1) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_registerTestCondition * GGS_registerTestCondition::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_registerTestCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_registerTestCondition *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_registerTestCondition::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_registerTestCondition * ptr = dynamic_cast <const cPtr_registerTestCondition *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mRegisterExpression.operator_isEqual (ptr->mRegisterExpression).boolValue ()
         && mBranchIfZero.operator_isEqual (ptr->mBranchIfZero).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_registerTestCondition::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@registerTestCondition:"
           << mRegisterExpression.reader_description (inIndentation + 1)
           << mBranchIfZero.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_registerTestCondition::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_registerTestCondition::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_registerTestCondition (& typeid (cPtr_registerTestCondition), & typeid (cPtr_conditionExpression), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_registerTestCondition::galgasRTTI (void) const {
  return & gClassInfoFor__registerTestCondition ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_registerTestCondition::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_registerTestCondition (mRegisterExpression, mBranchIfZero COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                 GALGAS class 'GGS_registerTestCondition'                  *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_registerTestCondition ("registerTestCondition", true, & kTypeDescriptor_GGS_conditionExpression) ;

//---------------------------------------------------------------------------*

GGS_registerTestCondition::
GGS_registerTestCondition (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_registerTestCondition::
GGS_registerTestCondition (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_registerTestCondition GGS_registerTestCondition::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_registerTestCondition result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_registerTestCondition *> (inPointer) != NULL)
      : (typeid (cPtr_registerTestCondition) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_registerTestCondition (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_registerTestCondition),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerTestCondition GGS_registerTestCondition::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_registerExpression & argument_0,
                 const GGS_bool& argument_1
                                COMMA_LOCATION_ARGS) {
  GGS_registerTestCondition result ;
  macroMyNew (result.mPointer, cPtr_registerTestCondition (argument_0,
                                argument_1 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerExpression  GGS_registerTestCondition::
reader_mRegisterExpression (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_registerExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_registerTestCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_registerTestCondition *) mPointer)->mRegisterExpression ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_registerTestCondition::
reader_mBranchIfZero (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_bool  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_registerTestCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_registerTestCondition *) mPointer)->mBranchIfZero ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_registerTestCondition::actualTypeName (void) const {
  return "registerTestCondition" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__registerTestCondition ("registerTestCondition", gClassInfoFor__conditionExpression, & kTypeDescriptor_GGS_registerTestCondition) ;

//---------------------------------------------------------------------------*

