pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_object GGS_registerTestCondition::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_registerTestCondition * p = NULL ;
    macroMyNew (p, GGS_registerTestCondition (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerTestCondition GGS_registerTestCondition::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_registerTestCondition result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_registerTestCondition * p = dynamic_cast <const GGS_registerTestCondition *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_registerTestCondition, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_registerTestCondition::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_registerTestCondition ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                Class for 'registerComparison' Enumeration                 *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_registerComparison ("registerComparison", false, NULL) ;

//---------------------------------------------------------------------------*

bool GGS_registerComparison::
isBuilt (void) const {
  return mValue > kNotBuilt ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_registerComparison::
operator_isEqual (const GGS_registerComparison inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue == inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_registerComparison::
operator_isNotEqual (const GGS_registerComparison inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue != inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_registerComparison::
operator_infOrEqual (const GGS_registerComparison inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue <= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_registerComparison::
operator_supOrEqual (const GGS_registerComparison inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue >= inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_registerComparison::
operator_strictInf (const GGS_registerComparison inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue < inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_registerComparison::
operator_strictSup (const GGS_registerComparison inOperand) const {
  return GGS_bool (isBuilt () && inOperand.isBuilt (),
                   mValue > inOperand.mValue) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_registerComparison::
reader_mnemonic (C_Compiler & /* inLexique */
                       COMMA_UNUSED_LOCATION_ARGS) const {
  const char * kMessages [7] = {"",
    "==",
    ">",
    ">=",
    "<",
    "<=",
    "!="
  } ;
  return GGS_string (mValue > 0, kMessages [mValue]) ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_registerComparison::
reader_description (const PMSInt32 /* inIndentation */) const {
  C_String s ;
  s << "<enum @registerComparison" ;
  switch (mValue) {
  case enum_equal:
    s << " equal>" ;
    break ;
  case enum_greater:
    s << " greater>" ;
    break ;
  case enum_greaterOrEqual:
    s << " greaterOrEqual>" ;
    break ;
  case enum_lower:
    s << " lower>" ;
    break ;
  case enum_lowerOrEqual:
    s << " lowerOrEqual>" ;
    break ;
  case enum_notEqual:
    s << " notEqual>" ;
    break ;
  case kNotBuilt:
    s << " (not built)>" ;
    break ;
  }
  return GGS_string (true, s) ;
}

//---------------------------------------------------------------------------*

GGS_object GGS_registerComparison::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_registerComparison * p = NULL ;
    macroMyNew (p, GGS_registerComparison (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerComparison GGS_registerComparison::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_registerComparison result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_registerComparison * p = dynamic_cast <const GGS_registerComparison *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_registerComparison, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

