pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
const C_galgas_type_descriptorEX * GGS_registerComparison::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_registerComparison ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//      Implementation of routine "getRegisterComparisonComplementary"       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_getRegisterComparisonComplementary (C_Compiler & inLexique,
                                const GGS_registerComparison  var_cas_inComparison,
                                GGS_registerComparison & var_cas_outComparison COMMA_UNUSED_LOCATION_ARGS) {
  #ifdef DEBUG_TRACE_ENABLED
    printf ("ENTER routine_getRegisterComparisonComplementary at %s:%d\n", __FILE__, __LINE__) ;
  #endif
  switch (var_cas_inComparison.enumValue ()) {
  case GGS_registerComparison::enum_notEqual:
    {
    var_cas_outComparison = GGS_registerComparison::constructor_equal (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_registerComparison::enum_equal:
    {
    var_cas_outComparison = GGS_registerComparison::constructor_notEqual (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_registerComparison::enum_greaterOrEqual:
    {
    var_cas_outComparison = GGS_registerComparison::constructor_lower (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_registerComparison::enum_greater:
    {
    var_cas_outComparison = GGS_registerComparison::constructor_lowerOrEqual (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_registerComparison::enum_lowerOrEqual:
    {
    var_cas_outComparison = GGS_registerComparison::constructor_greater (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_registerComparison::enum_lower:
    {
    var_cas_outComparison = GGS_registerComparison::constructor_greaterOrEqual (inLexique COMMA_HERE) ;
    }
    break ;
  case GGS_registerComparison::kNotBuilt:
    break ;
  }
  #ifdef DEBUG_TRACE_ENABLED
    printf ("LEAVE routine_getRegisterComparisonComplementary\n") ;
  #endif
}

//---------------------------------------------------------------------------*
//                                                                           *
//    Implementation of routine "getRegisterComparisonInstructionCount"      *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_getRegisterComparisonInstructionCount (C_Compiler &,
                                const GGS_registerComparison  var_cas_inComparison,
                                GGS_uint  & var_cas_outInstructionCount COMMA_UNUSED_LOCATION_ARGS) {
  #ifdef DEBUG_TRACE_ENABLED
    printf ("ENTER routine_getRegisterComparisonInstructionCount at %s:%d\n", __FILE__, __LINE__) ;
  #endif
  switch (var_cas_inComparison.enumValue ()) {
  case GGS_registerComparison::enum_notEqual:
    {
    var_cas_outInstructionCount = GGS_uint (2U) ;
    }
    break ;
  case GGS_registerComparison::enum_equal:
    {
    var_cas_outInstructionCount = GGS_uint (3U) ;
    }
    break ;
  case GGS_registerComparison::enum_greaterOrEqual:
    {
    var_cas_outInstructionCount = GGS_uint (2U) ;
    }
    break ;
  case GGS_registerComparison::enum_greater:
    {
    var_cas_outInstructionCount = GGS_uint (3U) ;
    }
    break ;
  case GGS_registerComparison::enum_lowerOrEqual:
    {
    var_cas_outInstructionCount = GGS_uint (2U) ;
    }
    break ;
  case GGS_registerComparison::enum_lower:
    {
    var_cas_outInstructionCount = GGS_uint (3U) ;
    }
    break ;
  case GGS_registerComparison::kNotBuilt:
    break ;
  }
  #ifdef DEBUG_TRACE_ENABLED
    printf ("LEAVE routine_getRegisterComparisonInstructionCount\n") ;
  #endif
}

//---------------------------------------------------------------------------*
//                                                                           *
//                 class 'cPtr_registerComparisonCondition'                  *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_registerComparisonCondition::
cPtr_registerComparisonCondition (const GGS_registerExpression & argument_0,
                                const GGS_registerComparison& argument_1
                                COMMA_LOCATION_ARGS)
:cPtr_conditionExpression (THERE),
mRegisterExpression (argument_0),
mComparison (argument_1) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_registerComparisonCondition * GGS_registerComparisonCondition::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_registerComparisonCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_registerComparisonCondition *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_registerComparisonCondition::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_registerComparisonCondition * ptr = dynamic_cast <const cPtr_registerComparisonCondition *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mRegisterExpression.operator_isEqual (ptr->mRegisterExpression).boolValue ()
         && mComparison.operator_isEqual (ptr->mComparison).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_registerComparisonCondition::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@registerComparisonCondition:"
           << mRegisterExpression.reader_description (inIndentation + 1)
           << mComparison.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_registerComparisonCondition::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_registerComparisonCondition::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_registerComparisonCondition (& typeid (cPtr_registerComparisonCondition), & typeid (cPtr_conditionExpression), "") ;

//---------------------------------------------------------------------------*

