pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
AC_galgasClassRunTimeInformationEX * cPtr_registerComparisonCondition::galgasRTTI (void) const {
  return & gClassInfoFor__registerComparisonCondition ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_registerComparisonCondition::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_registerComparisonCondition (mRegisterExpression, mComparison COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//              GALGAS class 'GGS_registerComparisonCondition'               *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_registerComparisonCondition ("registerComparisonCondition", true, & kTypeDescriptor_GGS_conditionExpression) ;

//---------------------------------------------------------------------------*

GGS_registerComparisonCondition::
GGS_registerComparisonCondition (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_registerComparisonCondition::
GGS_registerComparisonCondition (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_registerComparisonCondition GGS_registerComparisonCondition::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_registerComparisonCondition result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_registerComparisonCondition *> (inPointer) != NULL)
      : (typeid (cPtr_registerComparisonCondition) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_registerComparisonCondition (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_registerComparisonCondition),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerComparisonCondition GGS_registerComparisonCondition::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_registerExpression & argument_0,
                 const GGS_registerComparison& argument_1
                                COMMA_LOCATION_ARGS) {
  GGS_registerComparisonCondition result ;
  macroMyNew (result.mPointer, cPtr_registerComparisonCondition (argument_0,
                                argument_1 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerExpression  GGS_registerComparisonCondition::
reader_mRegisterExpression (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_registerExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_registerComparisonCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_registerComparisonCondition *) mPointer)->mRegisterExpression ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerComparison GGS_registerComparisonCondition::
reader_mComparison (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_registerComparison  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_registerComparisonCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_registerComparisonCondition *) mPointer)->mComparison ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_registerComparisonCondition::actualTypeName (void) const {
  return "registerComparisonCondition" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__registerComparisonCondition ("registerComparisonCondition", gClassInfoFor__conditionExpression, & kTypeDescriptor_GGS_registerComparisonCondition) ;

//---------------------------------------------------------------------------*

GGS_object GGS_registerComparisonCondition::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_registerComparisonCondition * p = NULL ;
    macroMyNew (p, GGS_registerComparisonCondition (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_registerComparisonCondition GGS_registerComparisonCondition::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_registerComparisonCondition result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_registerComparisonCondition * p = dynamic_cast <const GGS_registerComparisonCondition *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_registerComparisonCondition, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

