pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
const C_galgas_type_descriptorEX * GGS_incDecRegisterInCondition::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_incDecRegisterInCondition ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//               class 'cPtr_bcc_in_structured_if_condition'                 *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_bcc_in_structured_if_condition::
cPtr_bcc_in_structured_if_condition (const GGS_conditional_branch& argument_0
                                COMMA_LOCATION_ARGS)
:cPtr_conditionExpression (THERE),
mCondition (argument_0) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_bcc_in_structured_if_condition * GGS_bcc_in_structured_if_condition::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_bcc_in_structured_if_condition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_bcc_in_structured_if_condition *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_bcc_in_structured_if_condition::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_bcc_in_structured_if_condition * ptr = dynamic_cast <const cPtr_bcc_in_structured_if_condition *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mCondition.operator_isEqual (ptr->mCondition).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_bcc_in_structured_if_condition::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@bcc_in_structured_if_condition:"
           << mCondition.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_bcc_in_structured_if_condition::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_bcc_in_structured_if_condition::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_bcc_in_structured_if_condition (& typeid (cPtr_bcc_in_structured_if_condition), & typeid (cPtr_conditionExpression), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_bcc_in_structured_if_condition::galgasRTTI (void) const {
  return & gClassInfoFor__bcc_in_structured_if_condition ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_bcc_in_structured_if_condition::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_bcc_in_structured_if_condition (mCondition COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//            GALGAS class 'GGS_bcc_in_structured_if_condition'              *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_bcc_in_structured_if_condition ("bcc_in_structured_if_condition", true, & kTypeDescriptor_GGS_conditionExpression) ;

//---------------------------------------------------------------------------*

GGS_bcc_in_structured_if_condition::
GGS_bcc_in_structured_if_condition (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_bcc_in_structured_if_condition::
GGS_bcc_in_structured_if_condition (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_bcc_in_structured_if_condition GGS_bcc_in_structured_if_condition::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_bcc_in_structured_if_condition result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_bcc_in_structured_if_condition *> (inPointer) != NULL)
      : (typeid (cPtr_bcc_in_structured_if_condition) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_bcc_in_structured_if_condition (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_bcc_in_structured_if_condition),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bcc_in_structured_if_condition GGS_bcc_in_structured_if_condition::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_conditional_branch& argument_0
                                COMMA_LOCATION_ARGS) {
  GGS_bcc_in_structured_if_condition result ;
  macroMyNew (result.mPointer, cPtr_bcc_in_structured_if_condition (argument_0 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_conditional_branch GGS_bcc_in_structured_if_condition::
reader_mCondition (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_conditional_branch  result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_bcc_in_structured_if_condition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_bcc_in_structured_if_condition *) mPointer)->mCondition ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

