pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
const char * GGS_bcc_in_structured_if_condition::actualTypeName (void) const {
  return "bcc_in_structured_if_condition" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__bcc_in_structured_if_condition ("bcc_in_structured_if_condition", gClassInfoFor__conditionExpression, & kTypeDescriptor_GGS_bcc_in_structured_if_condition) ;

//---------------------------------------------------------------------------*

GGS_object GGS_bcc_in_structured_if_condition::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_bcc_in_structured_if_condition * p = NULL ;
    macroMyNew (p, GGS_bcc_in_structured_if_condition (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_bcc_in_structured_if_condition GGS_bcc_in_structured_if_condition::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_bcc_in_structured_if_condition result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_bcc_in_structured_if_condition * p = dynamic_cast <const GGS_bcc_in_structured_if_condition *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_bcc_in_structured_if_condition, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_bcc_in_structured_if_condition::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_bcc_in_structured_if_condition ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                       class 'cPtr_negateCondition'                        *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_negateCondition::
cPtr_negateCondition (const GGS_conditionExpression & argument_0
                                COMMA_LOCATION_ARGS)
:cPtr_conditionExpression (THERE),
mCondition (argument_0) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_negateCondition * GGS_negateCondition::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_negateCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_negateCondition *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_negateCondition::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_negateCondition * ptr = dynamic_cast <const cPtr_negateCondition *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mCondition.operator_isEqual (ptr->mCondition).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_negateCondition::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@negateCondition:"
           << mCondition.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_negateCondition::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_negateCondition::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_negateCondition (& typeid (cPtr_negateCondition), & typeid (cPtr_conditionExpression), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_negateCondition::galgasRTTI (void) const {
  return & gClassInfoFor__negateCondition ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_negateCondition::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_negateCondition (mCondition COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                    GALGAS class 'GGS_negateCondition'                     *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_negateCondition ("negateCondition", true, & kTypeDescriptor_GGS_conditionExpression) ;

//---------------------------------------------------------------------------*

GGS_negateCondition::
GGS_negateCondition (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_negateCondition::
GGS_negateCondition (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_negateCondition GGS_negateCondition::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_negateCondition result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_negateCondition *> (inPointer) != NULL)
      : (typeid (cPtr_negateCondition) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_negateCondition (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_negateCondition),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

