pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_negateCondition GGS_negateCondition::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_conditionExpression & argument_0
                                COMMA_LOCATION_ARGS) {
  GGS_negateCondition result ;
  macroMyNew (result.mPointer, cPtr_negateCondition (argument_0 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_conditionExpression  GGS_negateCondition::
reader_mCondition (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_conditionExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_negateCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_negateCondition *) mPointer)->mCondition ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_negateCondition::actualTypeName (void) const {
  return "negateCondition" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__negateCondition ("negateCondition", gClassInfoFor__conditionExpression, & kTypeDescriptor_GGS_negateCondition) ;

//---------------------------------------------------------------------------*

GGS_object GGS_negateCondition::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_negateCondition * p = NULL ;
    macroMyNew (p, GGS_negateCondition (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_negateCondition GGS_negateCondition::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_negateCondition result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_negateCondition * p = dynamic_cast <const GGS_negateCondition *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_negateCondition, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_negateCondition::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_negateCondition ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                        class 'cPtr_andCondition'                          *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_andCondition::
cPtr_andCondition (const GGS_conditionExpression & argument_0,
                                const GGS_conditionExpression & argument_1
                                COMMA_LOCATION_ARGS)
:cPtr_conditionExpression (THERE),
mLeftExpression (argument_0),
mRightExpression (argument_1) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_andCondition * GGS_andCondition::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_andCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_andCondition *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_andCondition::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_andCondition * ptr = dynamic_cast <const cPtr_andCondition *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mLeftExpression.operator_isEqual (ptr->mLeftExpression).boolValue ()
         && mRightExpression.operator_isEqual (ptr->mRightExpression).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_andCondition::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@andCondition:"
           << mLeftExpression.reader_description (inIndentation + 1)
           << mRightExpression.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_andCondition::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_andCondition::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_andCondition (& typeid (cPtr_andCondition), & typeid (cPtr_conditionExpression), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_andCondition::galgasRTTI (void) const {
  return & gClassInfoFor__andCondition ;
}

//---------------------------------------------------------------------------*

cPtr__AC_galgas_class * cPtr_andCondition::makeClone (void) const {
  cPtr__AC_galgas_class * result = NULL ;
  macroMyNew (result, cPtr_andCondition (mLeftExpression, mRightExpression COMMA_HERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                     GALGAS class 'GGS_andCondition'                       *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_andCondition ("andCondition", true, & kTypeDescriptor_GGS_conditionExpression) ;

//---------------------------------------------------------------------------*

