pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_andCondition::
GGS_andCondition (const cPtr__AC_galgas_class * inPointer) {
  macroAssignPointer (mPointer, (cPtr__AC_galgas_class *) inPointer) ;
}

//---------------------------------------------------------------------------*

GGS_andCondition::
GGS_andCondition (cPtr__AC_galgas_class & inObject) {
  macroAssignPointer (mPointer, & inObject) ;
}

//---------------------------------------------------------------------------*

//--- castFrom class method (implements cast expression)
GGS_andCondition GGS_andCondition::
castFrom (C_Compiler & inLexique,
           cPtr__AC_galgas_class * inPointer,
           const bool inUseKindOfClass,
           const GGS_location & inErrorLocation
           COMMA_LOCATION_ARGS) {
  GGS_andCondition result ;
  if (inPointer != NULL) {
    macroValidPointer (inPointer) ;
    const bool ok = inUseKindOfClass
      ? (dynamic_cast <cPtr_andCondition *> (inPointer) != NULL)
      : (typeid (cPtr_andCondition) == typeid (*inPointer)) ;
    if (ok) {
      result = GGS_andCondition (inPointer) ;
    }else{
      inErrorLocation.signalCastError (inLexique,
                                       & typeid (cPtr_andCondition),
                                       inUseKindOfClass,
                                       inPointer->instanceMessage ()
                                       COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_andCondition GGS_andCondition::
constructor_new (C_Compiler & /* inLexique */,
                 const GGS_conditionExpression & argument_0,
                 const GGS_conditionExpression & argument_1
                                COMMA_LOCATION_ARGS) {
  GGS_andCondition result ;
  macroMyNew (result.mPointer, cPtr_andCondition (argument_0,
                                argument_1 COMMA_THERE)) ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_conditionExpression  GGS_andCondition::
reader_mLeftExpression (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_conditionExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_andCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_andCondition *) mPointer)->mLeftExpression ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_conditionExpression  GGS_andCondition::
reader_mRightExpression (C_Compiler & /* inLexique */ COMMA_UNUSED_LOCATION_ARGS) const {
  GGS_conditionExpression   result ;
  if (mPointer != NULL) {
    macroValidPointer (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_andCondition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    result = ((cPtr_andCondition *) mPointer)->mRightExpression ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

const char * GGS_andCondition::actualTypeName (void) const {
  return "andCondition" ;
}

//---------------------------------------------------------------------------*

C_galgasClassRunTimeInformationEX gClassInfoFor__andCondition ("andCondition", gClassInfoFor__conditionExpression, & kTypeDescriptor_GGS_andCondition) ;

//---------------------------------------------------------------------------*

GGS_object GGS_andCondition::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_andCondition * p = NULL ;
    macroMyNew (p, GGS_andCondition (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_andCondition GGS_andCondition::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_andCondition result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_andCondition * p = dynamic_cast <const GGS_andCondition *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_andCondition, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_andCondition::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_andCondition ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//             class 'cPtr_bitTest_in_structured_if_condition'               *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_bitTest_in_structured_if_condition::
cPtr_bitTest_in_structured_if_condition (const GGS_registerExpression & argument_0,
                                const GGS_bitNumberExpression & argument_1,
                                const GGS_bool& argument_2
                                COMMA_LOCATION_ARGS)
:cPtr_conditionExpression (THERE),
mRegisterExpression (argument_0),
mBitNumber (argument_1),
mBTFSSinstruction (argument_2) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_bitTest_in_structured_if_condition * GGS_bitTest_in_structured_if_condition::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_bitTest_in_structured_if_condition *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_bitTest_in_structured_if_condition *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_bitTest_in_structured_if_condition::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_bitTest_in_structured_if_condition * ptr = dynamic_cast <const cPtr_bitTest_in_structured_if_condition *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mRegisterExpression.operator_isEqual (ptr->mRegisterExpression).boolValue ()
         && mBitNumber.operator_isEqual (ptr->mBitNumber).boolValue ()
         && mBTFSSinstruction.operator_isEqual (ptr->mBTFSSinstruction).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_bitTest_in_structured_if_condition::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@bitTest_in_structured_if_condition:"
           << mRegisterExpression.reader_description (inIndentation + 1)
           << mBitNumber.reader_description (inIndentation + 1)
           << mBTFSSinstruction.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

const char * cPtr_bitTest_in_structured_if_condition::
instanceMessage (void) const {
  return "" ;
}

//---------------------------------------------------------------------------*

const char * cPtr_bitTest_in_structured_if_condition::
_static_message (void) {
  return "" ;
}

//---------------------------------------------------------------------------*

C_galgas_class_inspector _gInspectorFor_bitTest_in_structured_if_condition (& typeid (cPtr_bitTest_in_structured_if_condition), & typeid (cPtr_conditionExpression), "") ;

//---------------------------------------------------------------------------*

AC_galgasClassRunTimeInformationEX * cPtr_bitTest_in_structured_if_condition::galgasRTTI (void) const {
  return & gClassInfoFor__bitTest_in_structured_if_condition ;
}

//---------------------------------------------------------------------------*

