pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
C_galgasClassRunTimeInformationEX gClassInfoFor__instruction_structured_if ("instruction_structured_if", gClassInfoFor__piccolo_instruction, & kTypeDescriptor_GGS_instruction_structured_if) ;

//---------------------------------------------------------------------------*

GGS_object GGS_instruction_structured_if::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_instruction_structured_if * p = NULL ;
    macroMyNew (p, GGS_instruction_structured_if (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_instruction_structured_if GGS_instruction_structured_if::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_instruction_structured_if result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_instruction_structured_if * p = dynamic_cast <const GGS_instruction_structured_if *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_instruction_structured_if, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_instruction_structured_if::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_instruction_structured_if ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                       Element of list '@partList'                         *
//                                                                           *
//---------------------------------------------------------------------------*

elementOf_GGS_partList::
elementOf_GGS_partList (const GGS_conditionExpression & argument_0,
                                const GGS_instructionList & argument_1,
                                const GGS_location & argument_2
                                COMMA_LOCATION_ARGS) :
AC_galgas_list::cListElement (THERE),
mCondition (argument_0),
mInstructionList (argument_1),
mEndOfPartLocation (argument_2) {
}

//---------------------------------------------------------------------------*

bool elementOf_GGS_partList::
isEqualToObject (const cListElement * inOperand) const {
  bool equal = inOperand == this ;
  if (! equal) {
    const elementOf_GGS_partList * ptr = dynamic_cast <const elementOf_GGS_partList *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mCondition.operator_isEqual (ptr->mCondition).boolValue ()
         && mInstructionList.operator_isEqual (ptr->mInstructionList).boolValue ()
         && mEndOfPartLocation.operator_isEqual (ptr->mEndOfPartLocation).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void elementOf_GGS_partList::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "|-" ;
  ioString << mCondition.reader_description (inIndentation) ;
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "|-" ;
  ioString << mInstructionList.reader_description (inIndentation) ;
  ioString << "\n" ;
  ioString.writeStringMultiple ("| ", inIndentation) ;
  ioString << "|-" ;
  ioString << mEndOfPartLocation.reader_description (inIndentation) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                             List '@partList'                              *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX kTypeDescriptor_GGS_partList ("partList", false, NULL) ;

//---------------------------------------------------------------------------*

void GGS_partList::
internalAppendValues (const GGS_conditionExpression & argument_0,
                    const GGS_instructionList & argument_1,
                    const GGS_location & argument_2
                    COMMA_LOCATION_ARGS) {
  cElement * nouvelElement = (cElement *) NULL ;
  macroMyNew (nouvelElement, cElement (argument_0,
                                argument_1,
                                argument_2
                                COMMA_THERE)) ;
  _internalAppendItem (nouvelElement) ;
}

//---------------------------------------------------------------------------*

void GGS_partList::
internalPrependValues (const GGS_conditionExpression & argument_0,
                    const GGS_instructionList & argument_1,
                    const GGS_location & argument_2
                    COMMA_LOCATION_ARGS) {
  cElement * nouvelElement = (cElement *) NULL ;
  macroMyNew (nouvelElement, cElement (argument_0,
                                argument_1,
                                argument_2
                                COMMA_THERE)) ;
  _internalPrependItem (nouvelElement) ;
}

//---------------------------------------------------------------------------*

void GGS_partList::
addAssign_operation (const GGS_conditionExpression & argument_0,
                                const GGS_instructionList & argument_1,
                                const GGS_location & argument_2) {
  if (isBuilt ()&& argument_0.isBuilt ()&& argument_1.isBuilt ()&& argument_2.isBuilt ()) {
    insulateList () ;
    internalAppendValues (argument_0,
                                argument_1,
                                argument_2
                                COMMA_HERE) ;
  }
}

//---------------------------------------------------------------------------*

