pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
GGS_location  GGS_partList::
reader_mEndOfPartLocationAtIndex (C_Compiler & inLexique, const GGS_uint & inIndex COMMA_LOCATION_ARGS) const {
  GGS_location  result ;
  if (isBuilt () && inIndex.isBuilt ()) {
    cElement * object = (cElement *) objectAtIndex (inLexique, inIndex.uintValue () COMMA_THERE) ;
    if (object != NULL) {
      result = object->mEndOfPartLocation ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

void GGS_partList::
modifier_setMConditionAtIndex (C_Compiler & inLexique,
                              const GGS_conditionExpression  & inObject,
                              const GGS_uint & inIndex
                              COMMA_LOCATION_ARGS) const {
  if (isBuilt () && inIndex.isBuilt ()) {
    cElement * object = (cElement *) objectAtIndex (inLexique, inIndex.uintValue () COMMA_THERE) ;
    if (object != NULL) {
      object->mCondition = inObject ;
    }
  }
}

//---------------------------------------------------------------------------*

void GGS_partList::
modifier_setMInstructionListAtIndex (C_Compiler & inLexique,
                              const GGS_instructionList  & inObject,
                              const GGS_uint & inIndex
                              COMMA_LOCATION_ARGS) const {
  if (isBuilt () && inIndex.isBuilt ()) {
    cElement * object = (cElement *) objectAtIndex (inLexique, inIndex.uintValue () COMMA_THERE) ;
    if (object != NULL) {
      object->mInstructionList = inObject ;
    }
  }
}

//---------------------------------------------------------------------------*

void GGS_partList::
modifier_setMEndOfPartLocationAtIndex (C_Compiler & inLexique,
                              const GGS_location  & inObject,
                              const GGS_uint & inIndex
                              COMMA_LOCATION_ARGS) const {
  if (isBuilt () && inIndex.isBuilt ()) {
    cElement * object = (cElement *) objectAtIndex (inLexique, inIndex.uintValue () COMMA_THERE) ;
    if (object != NULL) {
      object->mEndOfPartLocation = inObject ;
    }
  }
}

//---------------------------------------------------------------------------*

/* const */ GGS_conditionExpression  & GGS_partList::cEnumerator::_mCondition (LOCATION_ARGS) const {
  macroValidPointerThere (mCurrentEnumeratedObject) ;
  return ((/* const */ cElement *) mCurrentEnumeratedObject)->mCondition ;
}

//---------------------------------------------------------------------------*

/* const */ GGS_instructionList  & GGS_partList::cEnumerator::_mInstructionList (LOCATION_ARGS) const {
  macroValidPointerThere (mCurrentEnumeratedObject) ;
  return ((/* const */ cElement *) mCurrentEnumeratedObject)->mInstructionList ;
}

//---------------------------------------------------------------------------*

/* const */ GGS_location  & GGS_partList::cEnumerator::_mEndOfPartLocation (LOCATION_ARGS) const {
  macroValidPointerThere (mCurrentEnumeratedObject) ;
  return ((/* const */ cElement *) mCurrentEnumeratedObject)->mEndOfPartLocation ;
}

//---------------------------------------------------------------------------*

GGS_object GGS_partList::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_partList * p = NULL ;
    macroMyNew (p, GGS_partList (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_partList GGS_partList::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_partList result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_partList * p = dynamic_cast <const GGS_partList *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_partList, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_partList::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_partList ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                    class 'cPtr_instruction_do_while'                      *
//                                                                           *
//---------------------------------------------------------------------------*

cPtr_instruction_do_while::
cPtr_instruction_do_while (const GGS_location & argument_0,
                                const GGS_instructionList & argument_1,
                                const GGS_location & argument_2,
                                const GGS_partList & argument_3
                                COMMA_LOCATION_ARGS)
:cPtr_piccolo_instruction (argument_0 COMMA_THERE),
mRepeatedInstructionList (argument_1),
mEndOfRepeatedInstructionList (argument_2),
mWhilePartList (argument_3) {
}

//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  cPtr_instruction_do_while * GGS_instruction_do_while::
  operator () (LOCATION_ARGS) const {
    macroValidPointerThere (mPointer) ;
    MF_Assert (dynamic_cast <cPtr_instruction_do_while *> (mPointer) != NULL,
               "dynamic cast error", 0, 0) ;
    return (cPtr_instruction_do_while *) mPointer ;
  }
#endif

//---------------------------------------------------------------------------*

bool cPtr_instruction_do_while::
isEqualToObject (const cPtr__AC_galgas_class * inOperand) const {
  bool equal = typeid (this) == typeid (inOperand) ;
  if (equal) {
    const cPtr_instruction_do_while * ptr = dynamic_cast <const cPtr_instruction_do_while *> (inOperand) ;
    macroValidPointer (ptr) ;
    equal = mInstructionLocation.operator_isEqual (ptr->mInstructionLocation).boolValue ()
         && mRepeatedInstructionList.operator_isEqual (ptr->mRepeatedInstructionList).boolValue ()
         && mEndOfRepeatedInstructionList.operator_isEqual (ptr->mEndOfRepeatedInstructionList).boolValue ()
         && mWhilePartList.operator_isEqual (ptr->mWhilePartList).boolValue () ;
  }
  return equal ;
}

//---------------------------------------------------------------------------*

void cPtr_instruction_do_while::
appendForDescription (C_String & ioString,
                      const PMSInt32 inIndentation) const {
  ioString << "->@instruction_do_while:"
           << mInstructionLocation.reader_description (inIndentation + 1)
           << mRepeatedInstructionList.reader_description (inIndentation + 1)
           << mEndOfRepeatedInstructionList.reader_description (inIndentation + 1)
           << mWhilePartList.reader_description (inIndentation + 1) ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//                              Class message                                *
//                                                                           *
//---------------------------------------------------------------------------*

