pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_metamodel.cpp
const C_galgas_type_descriptorEX kTypeDescriptor_GGS_piccoloModel ("piccoloModel", false, NULL) ;

//---------------------------------------------------------------------------*

GGS_piccoloModel::GGS_piccoloModel (void) :
mProgramName (),
mProgramKind (),
mDeviceNameOrBootLoaderReference (),
mConfigDefinitionList (),
mAcceptDefaultConfiguration (),
mRamDefinitionList (),
mInterruptDefinitionList (),
mConstantDefinitionList (),
mRoutineDefinitionList (),
mNeedsComputedGoto2 (),
mNeedsComputedGoto4 (),
mEndOfProgram () {
}

//---------------------------------------------------------------------------*

GGS_piccoloModel::~GGS_piccoloModel (void) {
}

//---------------------------------------------------------------------------*

void GGS_piccoloModel::drop (void) {
  mProgramName.drop () ;
  mProgramKind.drop () ;
  mDeviceNameOrBootLoaderReference.drop () ;
  mConfigDefinitionList.drop () ;
  mAcceptDefaultConfiguration.drop () ;
  mRamDefinitionList.drop () ;
  mInterruptDefinitionList.drop () ;
  mConstantDefinitionList.drop () ;
  mRoutineDefinitionList.drop () ;
  mNeedsComputedGoto2.drop () ;
  mNeedsComputedGoto4.drop () ;
  mEndOfProgram.drop () ;
}

//---------------------------------------------------------------------------*

bool GGS_piccoloModel::isBuilt (void) const {
  return mProgramName.isBuilt ()
    && mProgramKind.isBuilt ()
    && mDeviceNameOrBootLoaderReference.isBuilt ()
    && mConfigDefinitionList.isBuilt ()
    && mAcceptDefaultConfiguration.isBuilt ()
    && mRamDefinitionList.isBuilt ()
    && mInterruptDefinitionList.isBuilt ()
    && mConstantDefinitionList.isBuilt ()
    && mRoutineDefinitionList.isBuilt ()
    && mNeedsComputedGoto2.isBuilt ()
    && mNeedsComputedGoto4.isBuilt ()
    && mEndOfProgram.isBuilt () ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_piccoloModel::
operator_isEqual (const GGS_piccoloModel & inOperand) const {
  return mProgramName.operator_isEqual (inOperand.mProgramName)
    .operator_and (mProgramKind.operator_isEqual (inOperand.mProgramKind))
    .operator_and (mDeviceNameOrBootLoaderReference.operator_isEqual (inOperand.mDeviceNameOrBootLoaderReference))
    .operator_and (mConfigDefinitionList.operator_isEqual (inOperand.mConfigDefinitionList))
    .operator_and (mAcceptDefaultConfiguration.operator_isEqual (inOperand.mAcceptDefaultConfiguration))
    .operator_and (mRamDefinitionList.operator_isEqual (inOperand.mRamDefinitionList))
    .operator_and (mInterruptDefinitionList.operator_isEqual (inOperand.mInterruptDefinitionList))
    .operator_and (mConstantDefinitionList.operator_isEqual (inOperand.mConstantDefinitionList))
    .operator_and (mRoutineDefinitionList.operator_isEqual (inOperand.mRoutineDefinitionList))
    .operator_and (mNeedsComputedGoto2.operator_isEqual (inOperand.mNeedsComputedGoto2))
    .operator_and (mNeedsComputedGoto4.operator_isEqual (inOperand.mNeedsComputedGoto4))
    .operator_and (mEndOfProgram.operator_isEqual (inOperand.mEndOfProgram)) ;
}

//---------------------------------------------------------------------------*

GGS_bool GGS_piccoloModel::
operator_isNotEqual (const GGS_piccoloModel & inOperand) const {
  return mProgramName.operator_isNotEqual (inOperand.mProgramName)
    .operator_or (mProgramKind.operator_isNotEqual (inOperand.mProgramKind))
    .operator_or (mDeviceNameOrBootLoaderReference.operator_isNotEqual (inOperand.mDeviceNameOrBootLoaderReference))
    .operator_or (mConfigDefinitionList.operator_isNotEqual (inOperand.mConfigDefinitionList))
    .operator_or (mAcceptDefaultConfiguration.operator_isNotEqual (inOperand.mAcceptDefaultConfiguration))
    .operator_or (mRamDefinitionList.operator_isNotEqual (inOperand.mRamDefinitionList))
    .operator_or (mInterruptDefinitionList.operator_isNotEqual (inOperand.mInterruptDefinitionList))
    .operator_or (mConstantDefinitionList.operator_isNotEqual (inOperand.mConstantDefinitionList))
    .operator_or (mRoutineDefinitionList.operator_isNotEqual (inOperand.mRoutineDefinitionList))
    .operator_or (mNeedsComputedGoto2.operator_isNotEqual (inOperand.mNeedsComputedGoto2))
    .operator_or (mNeedsComputedGoto4.operator_isNotEqual (inOperand.mNeedsComputedGoto4))
    .operator_or (mEndOfProgram.operator_isNotEqual (inOperand.mEndOfProgram)) ;
}

//---------------------------------------------------------------------------*

GGS_piccoloModel GGS_piccoloModel::
constructor_new (const GGS_lstring & argument_0,
                 const GGS_programKind& argument_1,
                 const GGS_lstring & argument_2,
                 const GGS_configDefinitionList & argument_3,
                 const GGS_bool& argument_4,
                 const GGS_ramDefinitionList & argument_5,
                 const GGS_interruptDefinitionList & argument_6,
                 const GGS_constantDefinitionList & argument_7,
                 const GGS_routineDefinitionList & argument_8,
                 const GGS_bool& argument_9,
                 const GGS_bool& argument_10,
                 const GGS_location & argument_11) {
  GGS_piccoloModel result ;
  result.mProgramName = argument_0 ;
  result.mProgramKind = argument_1 ;
  result.mDeviceNameOrBootLoaderReference = argument_2 ;
  result.mConfigDefinitionList = argument_3 ;
  result.mAcceptDefaultConfiguration = argument_4 ;
  result.mRamDefinitionList = argument_5 ;
  result.mInterruptDefinitionList = argument_6 ;
  result.mConstantDefinitionList = argument_7 ;
  result.mRoutineDefinitionList = argument_8 ;
  result.mNeedsComputedGoto2 = argument_9 ;
  result.mNeedsComputedGoto4 = argument_10 ;
  result.mEndOfProgram = argument_11 ;
  return result ;
}

//---------------------------------------------------------------------------*

GGS_string GGS_piccoloModel::
reader_description (const PMSInt32 inIndentation) const {
  C_String _s ;
  _s << "<struct @piccoloModel" ;
  if (isBuilt ()) {
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mProgramName " ;
    _s << mProgramName.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mProgramKind " ;
    _s << mProgramKind.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mDeviceNameOrBootLoaderReference " ;
    _s << mDeviceNameOrBootLoaderReference.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mConfigDefinitionList " ;
    _s << mConfigDefinitionList.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mAcceptDefaultConfiguration " ;
    _s << mAcceptDefaultConfiguration.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mRamDefinitionList " ;
    _s << mRamDefinitionList.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mInterruptDefinitionList " ;
    _s << mInterruptDefinitionList.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mConstantDefinitionList " ;
    _s << mConstantDefinitionList.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mRoutineDefinitionList " ;
    _s << mRoutineDefinitionList.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mNeedsComputedGoto2 " ;
    _s << mNeedsComputedGoto2.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mNeedsComputedGoto4 " ;
    _s << mNeedsComputedGoto4.reader_description (inIndentation + 1) ;
    _s << "\n" ;
    _s.writeStringMultiple ("| ", inIndentation + 1) ;
    _s << "mEndOfProgram " ;
    _s << mEndOfProgram.reader_description (inIndentation + 1) ;
  }else{
    _s << "not built" ;
  }
  _s << "\n" ;
  _s.writeStringMultiple ("| ", inIndentation) ;
  _s << ">" ;
  return GGS_string (true, _s) ;
}

//---------------------------------------------------------------------------*

GGS_object GGS_piccoloModel::reader_object (void) const {
  GGS_object result ;
  if (isBuilt ()) {
    GGS_piccoloModel * p = NULL ;
    macroMyNew (p, GGS_piccoloModel (*this)) ;
    result = GGS_object (p) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GGS_piccoloModel GGS_piccoloModel::castFromObject (C_Compiler & inLexique,
                                   const GGS_object & inObject,
                                   const GGS_location & inErrorLocation
                                   COMMA_LOCATION_ARGS) {
  GGS_piccoloModel result ;
  const GGS__root * embeddedObject = inObject.embeddedObject () ;
  if (NULL != embeddedObject) {
    const GGS_piccoloModel * p = dynamic_cast <const GGS_piccoloModel *> (embeddedObject) ;
    if (NULL != p) {
      result = * p ;
    }else{
      castFromObjectErrorSignaling (inLexique, inErrorLocation, & kTypeDescriptor_GGS_piccoloModel, embeddedObject COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*

const C_galgas_type_descriptorEX * GGS_piccoloModel::typeDescriptor (void) const {
  return & kTypeDescriptor_GGS_piccoloModel ;
}

//---------------------------------------------------------------------------*

